{"id":"4868144657123526991","startupName":"Stargazr","tagLine":"Predicting financial impact on operational processes","website":"www.stargazr.ai","foundingDate":"2020/05","stage":"pre-seed","segmentFocus":"B2B","industry":"Software & Information Technology","headquarters":"Germany","startupOverview":"Companies are wasting money in their manufacturing through inefficient process.  One reason is the lack of understanding of how manufacturing processes are impacting financial KPIs. The market in big data reporting and analysis tools worldwide with 19.6B and 23%. Our vision is to become must have for FP&A departments worldwide and a player for FP&A as Salesforce is for CRM, so that manufacturing companies save tons of jobs with better decision. Stargazr is developing a business prediction tool that uses non-financial KPIs to help their clients to understand the financial impact of processes in their operations. The founders are Rafi Wadan, who gained +5 year experience in Controlling and is finishing his PhD and Juan who finished his PhD in Computer Science. Currently, we have with Lufthansa Technik UK a pilot customer. Also, we start with 3 US customer new pilots from January on. There is a waiting list of 8 customers in our pipeline, which would like to get our solution implemented.","problemYouAreSolving":"Poor P&L management is the main reason why companies still have inefficient processes and lose therefore money in manufacturing. Companies overloaded with valueless KPIs and simple and useless forecasting, which is made on gut feeling and poor statistic skills.","productDescription":"Stargazr enables companies to see in which direction their company is heading in the future, using a powerful AI-based software.Our software uses a specific value driver framework which helps controlling to understand their results in real-time. Also, by using features like predictive analytics controlling can predict their figures or using sentiment analytics to understand how the world outside of the companies impact their controlling. ","whatMakesYourProductUnique":"We have built a unique value driver model, which was rolled out in a one-year project at Lufthansa Technik Los Angeles and saved 400 jobs. Based on that framework, we apply techniques like predictive analytics. That framework is unique and essential for the controller to understand the real drivers.","productReadiness":"We developed an MVP for our first pilot customer. We are looking for advice on how to acquire new customers without having the possibility to provide a demonstration on their own data since the integration process is too expensive to provide it as a free trial. tool will be market ready. ","productRoadMap":"The next step is the integration of the value driver with a forecasting product to obtain accurate predictions from both transactional and operational figures using AI methods. Also, we push towards an integration of SAP-centric ERP workflows through creation of an integration toolbox accessible from the web interface. After focusing on customer acquisition to improve the current set of solutions and broaden the range of formats supported by the autom. integration, our tool will be market ready","targetMarket":["United States","Germany","United Kingdom"],"marketDrivers":"Organizations across Europe and US have initiated work-from-home culture for their employees, which is creating demand for the cloud-based big data analytics to manage critical information of organizations, thus creating lucrative opportunity for the market. Also, Big data analytics is in high demand as organizations seek to use information assets to improve customer relationships, business outcomes, and operational efficiency. The beachhead market is the manufacturing industry. ","marketSize":"19,6B revenue in big data reporting and analysis tools worldwide in 2022","competition":"Strong competitors are existing analytics providers like Tableau or PowerBI, who are well established and focusing aggressively on the prediction of financial data. Also, Anaplan, Planful or Jedox are both FP&A software with a strong focus on planning processes including modern technology.","strengthAgainstCompetitors":"All competitors are solution without providing an understanding of operational drivers of companies. They only focus either on financial figures (e.g. Revenue) or only operational data. We offer through an \"off the shelf\" approach (no data science knowhow required) an explanatory model of KPIs.","challengesAgainstCompetitors":"They have a huge customer base through their common business and have a strong foundation on resources. ","revenueSources":"We currently do not obtain revenue, but are in talks about charging our first pilot client upfront.  ","salesStrategy":"We are targeting our first customers through an inbound sales approach, since our market target approach is enormous sales driven. After a 30 days trial, we would like to ask our customer a subscription fee about 25.000 USD a year, charged upfront. In addition to that, we would like to ask the customer an one time integration fee about 5.000 USD. ","traction":"Stargazr has a pipeline of 8 customers in europe, 12 in US. We were currently accepted in the leading B2B accelerator \"Alchemist Accelerator\" in San Francisco and into the AI Stream at the Creative Destruction Lab in Oxford. We aim in publishing articles about our area in educating our target group.","pilotsCustomers":"We currently have one pilot project in Europe. Now we build a customer base of 12 cutstomers in US and will execute 2 pilots per month. Those customers are SME manufacturing who need support in steering their business. We aim to have until May 2021 a fixed customer base of 5 to 8 customers.","metrics":"The most important metrics are (beside financial KPIs like revenue) the \"# of companies using our software\". In those companies, it is important to understand \"average time our software is used\". Also the #of users is important. Also, the \"% improvement of profit\" for our customers will be essential","howIsCompanyFunded":"Grant from IFB Innovationsstarter, Alchemist Accelerator","amountRaisedToDate":"98000","yourInvestors":"IFB Innovationsstarter, Alchemist Accelerator","fundingObjective":"Grant, Accelerator","numberOfFounders":"2","overallTeamSize":"3","foundersQualification":"Rafi, CEO, 5+ yrs. job experience as Financial Analyst and Controller at Beiersdorf and Lufthansa Technik. Researching on his PhD Degree about the topic \"Digitization on Controlling and FP&A\". Developed the unique Value Driver Model and saved around 400 jobs. Lecturer at Nordakademie Elmshorn and Northern Business School in Hamburg.\r\nJuan, CTO, finished his PhD as youngest scientist at the University of Seville in Computer Scientist. PhD thesis were covering the topic about \"Enterprise Data Integration\". Had experience as data engineer with industry projects in Canada and US during his research stay at the University of Southern California.","howImpact":"We are aiming to grow as an international startup, having its headquarters in Hamburg. We would like to grow our team with data scientist and engineers located in Hamburg. We would like to help companies around Hamburg and Germany in saving jobs through an efficient P&L management.","whatDegreeSustainability":"Our product aim to keep companies profitable and to fight against potential insolvency of manufacturing companies. The result should be that people in Hamburg have a satisfied job.","connectionToHamburg":"I am born and grew up in Hamburg, took nearly the entire education in Hamburg. As a founder I try to put Hamburg on the landscape when it comes about Finance and AI. Through my lecturing experience I aim to to pass on knowledge in the field of controlling, AI or data science to potential graduates to keep the level in hamburg high. We are connected with various Universities (University Hamburg, Statistic Department; Nordakademie Elmshorn) around Hamburg to transfer knowledge. ","collaborateWithEntityHamburg":"We are part of the Innofounder Program at the Innovations Foerderbank Hamburg.","howDidYouHearAboutFHA":"Press release","contactName":"Rafi Wadan","contactPosition":"CEO","contactPhoneNumber":"(017) 630-4286","contactEmail":"rafi.wadan@stargazr.ai","companyDeck":[{"type":"pdf","src":["DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-0.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-1.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-10.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-11.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-12.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-13.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-14.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-15.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-2.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-3.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-4.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-5.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-6.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-7.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-8.png","DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/optimized_Pitchdeck_Stargazr_012021-intro-9.png"],"original":"DATA/media/4868144657123526991/deck/Pitchdeck_Stargazr_012021-intro/Pitchdeck_Stargazr_012021-intro.pdf"}],"companyLogo":[{"type":"png","src":"DATA/media/4868144657123526991/logo/Logo_Stargazr_IFB/optimized_Logo_Stargazr_IFB.png"}]}