{"id":"4873051453631492154","startupName":"recyclehero (HC Sustainable Logistics GmbH)","tagLine":"Don´t Waste Your Time","website":"www.recyclehero.de","foundingDate":"13.08.2018","stage":"pre-seed","segmentFocus":"B2B B2C","industry":"Transportation & Logistics","headquarters":"Germany","startupOverview":"recyclehero was founded in August 2018 in Hamburg. The startup provides a social and sustainable pickup-service who supports restaurants, companies, shops  and private households by disposing recyclable waste (waste glas, waste paper, refundable bottles). The service is carried out by electrified cargo bikes. By today approx. 200 clients (B2B, B2C) in Hamburg are using the service - mostly subscription users. The business model is based on service-fees paid by the customer. The service was launched as a contemporary and time-saving recycling solution for private and business clients; determining the fight against rising traffic emissions and with a strong focus on social change (f.e. recyclehero also runs a homeless aid project called “Straßensuppe&#039;&#039;). The social startup is planning to expand their service in up to two more German cities within the year 2021.  recyclehero was founded by Nadine Herbrich (real estate background) and Alessandro Cocco (finance and banking background).","problemYouAreSolving":"Increase of the recycling quota for recyclable waste. We use electrified cargo bikes to avoid carbon emissions and increase visibility of e-cargo bikes in traffic. Preferably we engage socially & financially disadvantaged people. More ‘quality time’ for our clients.","productDescription":"The pickup can be ordered online - on demand or as subscription. Our heroes (drivers) collect the recyclables with electrified cargo bikes - directly at the client’s door. Disposal of waste glass and paper at recycling bins or recycling yard. Return of refundable bottles in supermarkets.","whatMakesYourProductUnique":"We are the first cargo bike pick up service for recyclable waste in Germany. For our service we use e-cargo bikes only. The bikes can load up until 200 kg. As waste paper/waste glas appear on a regular basis customers often subscribe to our service. Our model is based on profit and social profit.","productReadiness":"By today approx. 200 customers  (B2B, B2C) are using the service. We are focussing on automating some processes e.g. route planning. We own three cargo bikes. Our team consists of three to five drivers. Our pick-up area ranges from Ottensen to Hohenfelde, from Wintherhude to Hafencity.","productRoadMap":"Q1 2021: Further process automation, e.g. route/resource planning and client management and UX/UI optimization Q2 2021: Raising Seed Capital from Business Angels/Accelerators (Creating Marketing Campaign) Q3 2021: Hiring new staff and expansion to two further cities (Frankfurt and Leipzig) - launch marketing campaign, Q4 2021: Expand our service to other recyclables (electronic waste, old clothes); 2022: expansion to 3 to 4 cities (6 - 7 in total); 2023: expansion to 3-4 cities (9-11 in total).","targetMarket":["Germany"],"marketDrivers":"Big drivers are \"Verkehrswende\", zero waste movement and the focus on social and climate action which exactly meets mission and Zeitgeist of recyclehero. Partially also private and public waste companies are our competitors, however we rather focus on cases and clients that are not covered by them for several reasons. The cargo bike logistic infrastructure in Hamburg is developing very slow. e.g. we had difficulties to find micro hub solutions to decentralize our business throughout Hamburg.","marketSize":"2 billion Euro","competition":"Our service is currently only provided by Swiss companies (e.g. Recycling Service or Mr. Green). Some courier services in Hamburg do also offer pickups of waste paper, but for a significant higher price.  ","strengthAgainstCompetitors":"Our business model is based on a modern service for everybody - young WG´s, elderly people, small and medium business. Additionally it provides a good feeling to our customers as they also buy the climate friendly framework. Booking our service also means supporting our social projects and mission.","challengesAgainstCompetitors":"Preferably we dispose the collected recyclables at the recycling yard. Especially in times of Corona these yards where really crowded which led to long waiting situations for our drivers. We do not yet have the possibility to store and sell the recyclables as waste companies do.","revenueSources":"The b-model is based on service fees. For waste glas the base fee is 7,90 € for 20 kg. For waste paper it is 11,90 € for 20 kg. Larger quantities are additionally charged by weight (on demand costs 3,90 € extra). In addition we run company advertisements on our cargo bikes (500 € / bike / month).","salesStrategy":"Almost 100% of our customer inquiries result from inbound marketing, which is basically traceable to our PR & social media activity and SEO. All revenues were achieved without any marketing spendings yet. In 2021 we want to focus on outbound-marketing and begin to carry out our sales strategy. In addition we are working on building a community with focus on recycling and social topics, e.g. to help finance our project Straßensuppe people have the possibility to donate their refundable bottles.","traction":"recyclehero is supporting the idea of circular economy. We define a new level of household and commercial service, carried out in an appropriate and future orientated way. Therebye we touch the topics of traffic turnaround (last mile innovations) and are tackling social problems in a helpful manner.","pilotsCustomers":"About three quarters of our customers are commercial (restaurants, shops, offices). The number of private customers is increasing as it took time to build a reliable and trustworthy brand. In December 2018 we started a three months pilot phase. Most of the clients are still our clients today.","metrics":"Key performance indicators are sales per hour, customer density and efficient routing planning. An average tour has 10 to 15 stops. Besides good route planning the time of packing and disposing in between are essential for this KPI. Density: the shorter the distances the more efficient we are.","howIsCompanyFunded":"The company is 100% funded by the founders.","amountRaisedToDate":"0","yourInvestors":"We plan to start pre-seed in Q2 2021.","fundingObjective":"250000","numberOfFounders":"2","overallTeamSize":"3","foundersQualification":"Alessandro Cocco: He absolved his bachelor’s in finance & accounting and worked at the Asset Management department of a private bank for 6 years. He&#039;s passionate about economy, especially successful companies with focus on social and environmental impact. Nadine Herbrich: She studied real estate and worked in this industry (consulting/asset management) for 6 years. She has been a passionate animal welfarist since childhood. During her time in Real Estate she organized several helping projects in animal activism and refugee aid. For Nadine social entrepreneurship is a chance to use smart business ideas to create social & environmental impact.","howImpact":"Increasing recycling quota for recyclable waste, relief for city traffic by the use of zero emission electrified cargo bikes, more quality time for our customers, low threshold-access into the workforce for financially disadvantaged people. recyclehero was founded in and is Umweltpartner of Hamburg.","whatDegreeSustainability":"The model is based on the 3 pillars of sustainability. Economically: we bootstrapped the company to ensure the necessity of our service. Ecologically: we are a recycling service with a climate friendly transport solution. Socially: we create low-threshold jobs and carry out our own social projects.","connectionToHamburg":"Nadine Herbrich and Alessandro live in Hamburg. They presented the idea for the first time in 2017 at Social Innovation Challenge from Social Impact Lab Hamburg. The \"micro hub\" of recyclehero is in the garage of Fahrradstation Dammtor in Grindelviertel (storage and parking space for the bikes).","collaborateWithEntityHamburg":"1. Umweltpartnerschaft 2. With Hamburg Marketing on \"Aktion Pfandrad\" (zweimaliges Projekt mit HMG)","howDidYouHearAboutFHA":"Digital article","contactName":"Nadine Herbrich","contactPosition":"Co-founder (Co-Geschäftsführerin)","contactPhoneNumber":"(175) 682-6925","contactEmail":"nh@recyclehero.de","companyDeck":[{"type":"pdf","src":["DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-0.png","DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-1.png","DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-10.png","DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-11.png","DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-12.png","DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-2.png","DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-3.png","DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-4.png","DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-5.png","DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-6.png","DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-7.png","DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-8.png","DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/optimized_recyclehero_Pitchdeck_English_Future Hamburg Award-9.png"],"original":"DATA/media/4873051453631492154/deck/recyclehero_Pitchdeck_English_Future-Hamburg-Award/recyclehero_Pitchdeck_English_Future Hamburg Award.pdf"}],"companyLogo":[{"type":"jpg","src":"DATA/media/4873051453631492154/logo/IMG_4034/optimized_IMG_4034.jpg"},{"type":"jpg","src":"DATA/media/4873051453631492154/logo/logo-rch-dunkel/optimized_logo rch dunkel.jpg"}]}