{"id":"4874688226638167734","startupName":"MockUp No. 2","tagLine":"Zweite Dummy Bewerbung für den FHA","website":"https://zweitedummybewerbung.de","foundingDate":"heute","stage":"series A","segmentFocus":"B2B","industry":"Support Services","headquarters":"Algeria","startupOverview":"This is MockUp Startup Company No 2","problemYouAreSolving":"My Problem is the problem that my problem is too problematic as it is a great problem with a problematic Problem is the problem that my problem is too problematic as it is a great problem with a problematic Problem is the problem that my problem is too problematic as it is a great problem with a pro","productDescription":"a problematic problem","whatMakesYourProductUnique":"we solve problems we solve problems we solve problems we solve problems we solve problems we solve problems we solve problems we solve problems we solve problems we solve problems we solve problems we solve problems we solve problems we solve problems we solve problems and we love it and we love ita","productReadiness":"ready","productRoadMap":"yesterday, today, tomorrow","targetMarket":["Afghanistan"],"marketDrivers":"people hate problems people hate problems people hate problems people hate problems people hate problems ","marketSize":"fivehundrendtwentyforthousand","competition":"people are my competition people are my competition ","strengthAgainstCompetitors":"i am strong","challengesAgainstCompetitors":"we are too strong","revenueSources":"crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfu","salesStrategy":"sales strategy and pricing model sales strategy and pricing model sales strategy and pricing model sales strategy and pricing model sales strategy and pricing model sales strategy and pricing model sales strategy and pricing model sales strategy and pricing model sales strategy and pricing m","traction":"our startup exceeds in the area of startups. we generate momentum through our startup our startup exceeds in the area of startups. we generate momentum through our startup our startup exceeds i","pilotsCustomers":"pilots and customers","metrics":"what are the most important metrics? my metrics are the most important metrics! ","howIsCompanyFunded":"crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfunding crowdfund","amountRaisedToDate":"500","yourInvestors":"me myself and i","fundingObjective":"501","numberOfFounders":"62","overallTeamSize":"5","foundersQualification":"we have a startup","howImpact":"Hamburg is better off with us","whatDegreeSustainability":"to every degree is it integrated into our business model","connectionToHamburg":"we love Hamburg because of the water and the city and the food and the Ankers and the moin and the fun and the schanze and the st. Pauli and the eppendorf and the ulster","collaborateWithEntityHamburg":"no","howDidYouHearAboutFHA":"Instagram-Ads","contactName":"Startup 2","contactPosition":"founder","contactPhoneNumber":"(923) 985-4372","contactEmail":"sstartup2@startup2.com","companyDeck":[{"type":"jpg","src":"DATA/media/4874688226638167734/deck/unnamed/optimized_unnamed.jpg"}],"companyLogo":[]}