{"id":"4877402106312783676","startupName":"Blue Atlas Robotics ApS","tagLine":"Autonomous Underwater Inspection Solutions","website":"https://blueatlasrobotics.com/","foundingDate":"2018/10","stage":"series A","segmentFocus":"B2B","industry":"Other...","headquarters":"Denmark","startupOverview":"Blue Atlas Robotics Aps was founded in September 2018 by Carl Chatfield\r\nand is a company dedicated to the development of autonomously\r\noperating underwater robots for the precise imaging of vessels and other\r\nstructures exposed to the marine environment.\r\n\r\nUnderwater inspections have not significantly changed since the introduction of underwater video cameras. Video inspections capture hours of video and contain lots of information, but the information is unstructured, and today its potential value is not fully realized.\r\n\r\nThe market opportunity is for us to modernize underwater monitoring and inspections of vessels and other marine environment structures by working with a wide range of service providers, product manufactures, and equipment manufacturers, to deploy our autonomous imaging and analysis technology.\r\n\r\nWe are already in collaboration with different service providers and shipping companies that will enable us to achieve first sale of our product and service in 2021. \r\n\r\n\r\n\r\n\r\n\r\n","problemYouAreSolving":"The overall vision behind Blue Atlas Robotics is to develop a better way to understand the impact of the maritime industry on the marine environment on a global scale, through improved imaging capabilities of underwater structures.","productDescription":"Blue Atlas Robotics have developed a unique small designed Autonomous Operating Underwater Robot with an image processing technology tightly integrated with a large camera array, that allows for software based automatic computer vision based control and navigation of the Robot. The Robot can consistently and repeatedly image and produce 3-D models of large underwater structures. ","whatMakesYourProductUnique":"The combination of computer vision and autonomous software based navigation, allows for near range constant distance keeping, overcoming low visibility, improvoses images quality and allow for a full scale 3D-models with images embedded into same ","productReadiness":"Proof of concept with current version have been completed, commercial and technical ready for imaging vertical structures such as ports per today","productRoadMap":"Product development project initiated and first generation of final product scheduled to be released to the market for 3'rd party sale before the end of 2021","targetMarket":["United States","Australia","Denmark","Germany","New Zealand","Norway","Sweden"],"marketDrivers":"All Marine Environment Structures:Low overall cost of maintenance and life time.\r\nPre-drydock: Drydock is the largest maintenance cost. A well planned drydock negotiation can reduce the initial quote by 50%.\r\nBiofouling and Invasive Species: The regulatory regime within this area is expected to become ever more stringent, increasing the demand cost-effective monitoring and validation methods.\r\nOn-hire off-hire / Insurance Claims: These provide a before and after view to detect damages.\r\n\r\n ","marketSize":"100 - 200 Mill Euro","competition":"VideoRay has the greatest market share with 3.000 units in the field, each costing €25.000. Seabotix and DeepTrekker are the other major players. The current total market volume is app. 5.000 units, but it is seeing growth to meet new regulatory requirements and better maritine asset management.","strengthAgainstCompetitors":"Autonomous computer vision navigation, allow for a constant and near range imaging inspection process.\r\nQuality and imaging method, allow for applying of photogrammetry to produce 3D model on a different scale than anyone else.\r\nAbility to apply AI, as unmatched amount and quality of acquired data.","challengesAgainstCompetitors":"We do not provide a 1:1 inspection technology, different concept so need to convince the market of all the added value propositions from our technology.\r\nDifferent visual design, operational approach and much higher level of data delivery - overcome perception that today&#039;s approach is sufficient.","revenueSources":"Main revenue source will come from direct sales of equipment to relevant customer segments.\r\nAfter sale revenue will predominantly come from imaging and data processing service, that will be come from a cloud based solution.\r\nRest will come from Data storage and equipment service agreements. ","salesStrategy":"Business model will be based upon direct sale of our autonomous Robot to a\r\nnumber a different service provider, predominantly within the diving and surveying business segments, with various other service providers involved in supply of products, equipment and service related to the exterior of the hull.\r\nBlue Atlas Robotics will be providing imaging & Data Processing service, where recorded video can be uploaded to a data cloud managed by Blue Atlas Robotics.\r\n\r\n\r\n","traction":"We have establish a very broad network towards different service providers within shipping, ports and surveying as well as vessel owners. \r\nAlso involved in a number a blue economy networks, maritime clusters and academic institutions.\r\n  ","pilotsCustomers":"First pilots have been done towards vessel owners, maritime service providers and surveying companies.\r\nFirst commercial agreement have been signed in Q1-2021, with a trajectory of generating one or more revenue streams from Q1-2021 and forward.\r\nCollaboration with a larger maritime product supplier and vessel owner is expected to be launch in Q2-2021.","metrics":"Target to conduct inspection of any surface or object underwater at 900 m2 per hour, allowing for capturing 6 seperate HD video streams and generating a full scale 3D-model with all interbedded images within 24-72 hours.","howIsCompanyFunded":"Different Private Investors and Public funding","amountRaisedToDate":"1.0","yourInvestors":"ReInvest Robotics main investors, together with a number of other private investors.\r\nAdditional funding raised from Danish Maritime Fond, EUDP, Innovationsfonden.","fundingObjective":"1.0","numberOfFounders":"1","overallTeamSize":"4","foundersQualification":"Bsc. Computer Science 1 st Class Honors, University of New South Wales\r\nHonors Thesis: “A Foveated Vision System for Robotic Soccer”\r\n\r\nSoftware Engineer at Transcriptic, San Francisco  Robot Scheduling and Coordination Software Wrote compiler which translates Transcriptic’s life sciences protocol JSON description into device commands.\r\n\r\nEmploy No. 1 at ALICE Technologies, San Francisco\r\nAutomatic Construction Scheduling Software\r\nApplied optimisation techniques (Constraint Programming) across various scheduling and optimisation problems in construction.\r\n\r\n\r\n\r\n\r\n\r\n","howImpact":"With our autonomous underwater imaging technology, we can significantly improve knowledge and hence cost and resources need over time to maintain Port of Hamburg&#039;s underwater facilities in the best conditions for years to come.","whatDegreeSustainability":"We have integrated 4 UN sustainability goals into our product and business model.\r\n\r\n7. Affordable and Clean Energy\r\n8. Decent Work and Economic Growth\r\n13. Climate Action\r\n14. Life Below Water\r\n\r\n ","connectionToHamburg":"No","collaborateWithEntityHamburg":"Currently not in collaboration with any entity from Hamburg.","howDidYouHearAboutFHA":"LinkedIn","contactName":"Mads Andersen","contactPosition":"CEO","contactPhoneNumber":"(452) 928-2548","contactEmail":"mads@blueatlasrobotics.com","companyDeck":[{"type":"pdf","src":["DATA/media/4877402106312783676/deck/Pitch-Deck/optimized_Pitch Deck-0.png","DATA/media/4877402106312783676/deck/Pitch-Deck/optimized_Pitch Deck-1.png","DATA/media/4877402106312783676/deck/Pitch-Deck/optimized_Pitch Deck-10.png","DATA/media/4877402106312783676/deck/Pitch-Deck/optimized_Pitch Deck-2.png","DATA/media/4877402106312783676/deck/Pitch-Deck/optimized_Pitch Deck-3.png","DATA/media/4877402106312783676/deck/Pitch-Deck/optimized_Pitch Deck-4.png","DATA/media/4877402106312783676/deck/Pitch-Deck/optimized_Pitch Deck-5.png","DATA/media/4877402106312783676/deck/Pitch-Deck/optimized_Pitch Deck-6.png","DATA/media/4877402106312783676/deck/Pitch-Deck/optimized_Pitch Deck-7.png","DATA/media/4877402106312783676/deck/Pitch-Deck/optimized_Pitch Deck-8.png","DATA/media/4877402106312783676/deck/Pitch-Deck/optimized_Pitch Deck-9.png"],"original":"DATA/media/4877402106312783676/deck/Pitch-Deck/Pitch Deck.pdf"}],"companyLogo":[{"src":"DATA/media/4877402106312783676/logo/BAR/optimized_BAR.JPG"}]}