{"id":"4879888718514473820","startupName":"Easycom","tagLine":"From profitable digital returns to circular flows","website":"www.easycom.com","foundingDate":"2017-06-06","stage":"seed","segmentFocus":"B2C, B2B","industry":"Software & Information Technology","headquarters":"Sweden","startupOverview":"the challenge - Our customers are growing, but more than 30% are unprofitable. Meanwhile the environment is suffering. The root cause is high return-levels, inefficient distribution logistics and a lack of insights.\r\n\r\nthe solution - Making returns the enabler of a more profitable and sustainable eCommerce. Combining a true profitability view at the customer and product level, with the ability to make decisions in real time.\r\n\r\nthe platform - Proprietary software platform built on real-time information, an intelligent decision engine, and an intuitive GUI. Delivered in a software-as-a-service model, together with leading integration partners\r\n\r\nthe team - Cross-functional team with 100+ years combined experience in software development, eCommerce distribution, and building tech companies. Plus, Sweden’s leading researcher in retail management & return logistics","problemYouAreSolving":"Ecommerce is growing, but more than 30% of the companies are unprofitable. Meanwhile the environment is suffering. The root cause is high return-levels, inefficient distribution logistics and a lack of insights.","productDescription":"Digital return services with automated business rules to win back customer through exchanges, route products to best location based on cost and sustainability. True profitability KPI's to show most and least profitable customers and products in real-time for profitable conversion to maximize sales & marketing efforts. The services supports sustainable flows such as rental, 2nd life and upcycling.","whatMakesYourProductUnique":"Multiple returns customer and product journeys based on profitability to minimize environmental impact and decrease cost increase re-convertion and upsales with new orders. Dynamic return order orchestration and carrier compliants for advanced logistics.  ","productReadiness":"Proven in production with 16 customers and growing. Good statistics from customers on decreased cost, re-conversion winning back orders and also triggering new sales orders from the returns process.","productRoadMap":"Virtual stock for increased sales and lower risk for overstock. More detailed and automated prioritization of returns from customer, in carrier network and in warehouse sorting facilities. Forecasting on return stock, what will come back in what timeline. Improved and new KPI’s breaking down the full process from sales order to back in stock in eaven smaller legs/steps for more granular order orchestration.","targetMarket":["United States","Belgium","Canada","Denmark","France","Germany","Netherlands","Norway","Poland","Portugal","Spain","Sweden","Switzerland","United Kingdom"],"marketDrivers":"Online sales exceeded expectations, pre-covid planning & supply chains are struggling to keep up. Consequently, agile order & returns strategies are needed now more than ever & supply chain & inventory management (using inbound returns stock) is not only a short term solution, but central to planning for the future. Sustainability & circular economy planning begins in product design & sourcing. It’s not an afterthought but something that needs to be considered directly to be truly effective.","marketSize":"All ecom and retail companies in the selected markets.","competition":"Rebound, Zigzag, Optoro, Narvar.","strengthAgainstCompetitors":"Unique solution with True Profitability on products and customers and stronger with automated business rules and logistics solutions. Scientists with focus on consumer behaviour, returns and circular flows is part of the company. Long and deep experience from ecommere, retail, returns and logistics.","challengesAgainstCompetitors":"Market presence and pace is a challenge for most of the companies in this space as in most industries. ","revenueSources":"Recurring revenue from our services. Consultancy fees from projects and analysis.","salesStrategy":"Direct sales and through partners, currently starting cooperation with a large global OMS vendor.\r\n\r\nRecurring revenue model with monthly and transactional fees.","traction":"Good traction until now on the Nordic market and now focusing on international growht primarely in EU (Germany and UK) but via our partners addiotionally also North America.","pilotsCustomers":"Customers: Babyshop group, Didriksons, Stadium, Stellar Equipment, Kidsbrandstore, Nordic Nest, Bagaren & Kocken, Svea, Aimn, Gant, Cavour, Morjas.","metrics":"Proving that our services has positiv effect for our customers. One case triggered 8-11% new sales orders from our system and processes. Another case we we won back 24% of the orders via our dynamic exchange function in the return process. For all customers we have decreased number of calls & mail. ","howIsCompanyFunded":"Venture capital from angels and family offices","amountRaisedToDate":"2000000","yourInvestors":"Angels and family offices such as Findwise Ventures, Svanberg Invest, Tibia Consult and Almi Invest.","fundingObjective":"All in growth","numberOfFounders":"2","overallTeamSize":"7","foundersQualification":"Peter Hietala - 10 years on the carrier at Schenker side building the first pickup point network for ecom/mailorder. 11 years at a TMS vendor, Centiro Solutions, helping companies such as IKEA (for 10 years), Apple (with TNT), DHL, SKF, Bosch, H&M,  develop their global customer distribution. 3 years with RFID solution, hardware & software. 1 year with TMS & Customs systems at Descartes. 3 years at H&M as Global Distribution Manager Online.\r\nKlas Hjort - Researcher at Lund University, PhD in Technology Management, Chalmers University of Technology, specialising in Returns Management, External representative in IKEA’s DIN6 (Innovation team)","howImpact":"Our services can operate return hubs for ecommerce returns. Hamburg is the natural location for a hub to make Hamburg the point for ecommerce between Germany & Nordics. The hub can also perform services such as cleaning, repairing and storage to enable new services to the ecommerce market.","whatDegreeSustainability":"Our services decreases the number of returns and CO2 emissions. Our services enables circular flow such as rental and 2nd life that has a huge impact on sustainability. With a return hub in Hamburg this can be offered as a combine new service by Easycom and the city of Hamburg. ","connectionToHamburg":"No connection yet other than my previous connections with Hermes working at H&M.","collaborateWithEntityHamburg":"No.","howDidYouHearAboutFHA":"Business partner","contactName":"Peter Hietala","contactPosition":"Easycom","contactPhoneNumber":"(070) 634-8986","contactEmail":"peter.hietala@easycom.com","companyDeck":[{"type":"pdf","src":["DATA/media/4879888718514473820/deck/Easycom-in-brief/optimized_Easycom in brief-0.png","DATA/media/4879888718514473820/deck/Easycom-in-brief/optimized_Easycom in brief-1.png","DATA/media/4879888718514473820/deck/Easycom-in-brief/optimized_Easycom in brief-10.png","DATA/media/4879888718514473820/deck/Easycom-in-brief/optimized_Easycom in brief-11.png","DATA/media/4879888718514473820/deck/Easycom-in-brief/optimized_Easycom in brief-2.png","DATA/media/4879888718514473820/deck/Easycom-in-brief/optimized_Easycom in brief-3.png","DATA/media/4879888718514473820/deck/Easycom-in-brief/optimized_Easycom in brief-4.png","DATA/media/4879888718514473820/deck/Easycom-in-brief/optimized_Easycom in brief-5.png","DATA/media/4879888718514473820/deck/Easycom-in-brief/optimized_Easycom in brief-6.png","DATA/media/4879888718514473820/deck/Easycom-in-brief/optimized_Easycom in brief-7.png","DATA/media/4879888718514473820/deck/Easycom-in-brief/optimized_Easycom in brief-8.png","DATA/media/4879888718514473820/deck/Easycom-in-brief/optimized_Easycom in brief-9.png"],"original":"DATA/media/4879888718514473820/deck/Easycom-in-brief/Easycom in brief.pdf"}],"companyLogo":[{"type":"png","src":"DATA/media/4879888718514473820/logo/Easycom_liggande_logga_rgb/optimized_Easycom_liggande_logga_rgb.png"}]}