{"id":"4880855753772560590","startupName":"Casky","tagLine":"Making Commuting Safer","website":"https://casky.io","foundingDate":"20/12/2019","stage":"seed","segmentFocus":"B2B2C","industry":"Automotive","headquarters":"Morocco","startupOverview":"Being a 2 wheels driver is to face 21 Risks of death per 1 kilometer. And, even worse, 70% of motos accidents are caused by invisibility and drivers poor behavior. Around 1.3 millions dies each year. Africa beats the record with 26 deaths per 100,000 residents. The market size is 5.3 billion moto drivers Ww.\r\nThe fundamental idea of Casky derives from a personal pain point. 19 years ago; as a moto driver, i have experienced a near-death moto accident. Now, for drivers first, we are democratizing the use of the helmet by reducing insurance cost (bonus: 10%, 15% or 25%) and enhancing drivers visibility and safety due to IoT devices and IA which analyze the driver behaviour, predict the risk of the accident  and automatically send alert to family/emergency in case of an accident. Secondly, we are saving insurers money by reducing claims and rewarding commuting data. In 2020(1st year) we have generate about $120K and attract some institutions(police), cities, moto distributors and insurers.","problemYouAreSolving":"500k dies each year.","productDescription":"IoT devices (attached behind the helmet or embedded inside the 2 wheels (moto, scooter, bike) and connected to a mobile app. Both can predict the risk of an accident, alert emergency/family by sending real-time location, blood type, drivers info...We are also incetivizing the good driving bahiour over insurance bonus.","whatMakesYourProductUnique":"Mixing IoT and IA and offering and affordable useful solution. ","productReadiness":"The product is on the market, distributed over B2B partners like moto distributors and insurers.","productRoadMap":"We are working on a new feature to provide to the drivers complete solution able to track the road quality, air quality and pollution.  The objective is to provide the best route from point A to B.","targetMarket":["United States","Belgium","Brazil","Canada","China","Egypt","Finland","France","Germany","Kenya","Malaysia","Mexico","Morocco","Nigeria","Philippines","Rwanda","South Africa","Spain","Sweden","Switzerland","Taiwan","Thailand","Uganda","United Kingdom","Vietnam"],"marketDrivers":"Africa beats the record with 26 deaths per 100,000 residents. Reason why we are focusing on this market to solve more road issues. Micro mobility in Europe is growing so fast due to Covid-19 and the use of 2 wheels. \r\nHowever, Asia is the huge market (more than 60%). The big challenge is to \r\npenetrate each of these markets, with limited financial means. \r\nThe best solution is to go through local B2B partners (manufacturers, distributors, insurers ...)","marketSize":"5.3 billion","competition":"Cosmo connected: smart IoT device without IA. B2C.","strengthAgainstCompetitors":"Providing an IA able to predict the risk of accident, and rewarding driving behaviour. B2B2C over moto manufacturers, distributors, insurers.","challengesAgainstCompetitors":"To raise funds and continue to innovate.","revenueSources":"IoT devices, \r\n911 emergency subscription (/year).","salesStrategy":"B2B2C: 2 wheels manufacturers/distributors, insurers. \r\nIoT: $20-$50\r\n911 assistance: $18/year. \r\nDigital medical assistance (only mobile app, without IoT), which can prevent and detect the risk of accident and notify emergency/family : $18/year.\r\nMaaS platform: digital moto care for moto distributors. Monthly subscription. ","traction":"Mobility, Smart Cities, Insurtech.\r\n","pilotsCustomers":"Morocco: Police, main moto distributors, main insurer.\r\nKenya: Pay how you drive insurance partner, main ambulances network partner. \r\nUganda: Yamaha as a first customer. ","metrics":"$120K: 1st year (2020).\r\n8500 devices.\r\n~15K users/2020. (target: 33K users in March). ","howIsCompanyFunded":"Bootstrapping then $100K pre-seed","amountRaisedToDate":"100000","yourInvestors":"Kepple Africa Ventures.","fundingObjective":"350000","numberOfFounders":"1","overallTeamSize":"6","foundersQualification":"Abid KHIRANI, More than 19 years contribution in developing successful IT services, software conception and cross platform strategies to international institutions, such as TF1, TV5Monde, L&#039;Oreal, Hachette... I design, implement and maintain key performance indicators, provide input and proposals to increase bid wins.","howImpact":"Making 2 wheels commuting safer and smarter.\r\nCreating a real-time commuting open database: \r\n- road issues (pothole, donkey, dangerous turn),\r\n- air quality/pollution\r\n- ...\r\n\r\nby using bikes, scooter, motorcycles in order to make Hamburg a smart safe city.\r\n","whatDegreeSustainability":"It is the heart of our business model!","connectionToHamburg":"Plug and Play. \r\nCasky is accelerated in PnP Morocco.","collaborateWithEntityHamburg":"Not yet. We hope soon!","howDidYouHearAboutFHA":"Business partner","contactName":"Abid KHIRANI","contactPosition":"Founder/CEO (+212688999406)","contactPhoneNumber":"(212) 688-9994","contactEmail":"ak@casky.io","companyDeck":[{"src":"DATA/media/4880855753772560590/deck/Casky-_-Deck-Partenaires-UK.pdf/optimized_Casky _ Deck Partenaires UK.pdf.zip"}],"companyLogo":[{"type":"jpg","src":"DATA/media/4880855753772560590/logo/Casky_logo/optimized_Casky_logo.jpg"}]}