{"id":"4882273738915227866","startupName":"Sensestek Solutions Limited","tagLine":"The self-developed hybrid IoT+Blockchain MESH logistics sensing devices","website":"http://www.sensestek.com","foundingDate":"2019/01","stage":"seed","segmentFocus":"B2B","industry":"Transportation & Logistics","headquarters":"Hong Kong","startupOverview":"Nowadays, among all IoT solutions on the market, there are rarely a precise method which guarantee data are unhackable. With an annual revenue of USD44,000 million together with a growth rate of 15-18% per year, a disruptive traceability solution is therefore getting a lot of attention by worldwide logistics leaders who are willing to invest in the next 3 years.\r\n\r\nOur vision is to develop an upfront IoT device which are capable to embed the most secure encryption, hashing and data sharing technology which can be fully integrated among various logistics segments.\r\n\r\nOur founding team includes Kelvin Wong (CEO) and Damon Lau (CTO) who have fruitful experience in supply chain business development, hardware and software development respectively.\r\n\r\nThe traction is to enter the logistics management industry with these unique hybrid IoT+blockchain enabled hardware solution, with a recurring subscription model by utilising our IoT and blockchain dashboard in order to engage easily with clients.","problemYouAreSolving":"There is a big gap in between monitoring and traceability inside the logistics industry, blockchain and IoT has never been crossed over in one single solution which helps to ensure data reliability and transparency. Manual data modification has been found occasionally when shipment issues occur. ","productDescription":"Sensestek IoT and blockchain sensing device product family are designed for users who requires high hardware security and full data reliability, along with our unique MESH intercommunication protocol, such that data protection is to its maximum level. Our sensing products include temperature and moisture, vibration, open access, leakage and occupancy. Shipping conditions and status can be visualised through measurements whether the cargos are in good conditions.","whatMakesYourProductUnique":"Our unique IoT and blockchain devices are capable to transmit IoT raw data with the chain key as a packet to facilitate IoT and hashing, with our MESH protocols which also enables device’s data redundancy, the encrypted raw data will then be consolidated to our unique platform for decryption.","productReadiness":"Our sensing device family has completed small batch trial and are ready to commercialise. We are in the progress of applying our MESH patent PAG, and yet we have kicked off MESH and sign chain key protocol development already. ","productRoadMap":"Our roadmap is to complete firmware development within 9 months and commercialisation within the next 4 months on hardware. for platform we expect we can progressively complete standard package within 6 months together with firmware development. We will then introduce and deploy our solutions among insurance companies and forwarders in bundle packages by offering both hardware and subscription platform and to approach big logistics companies in offering our trial demo.","targetMarket":["Germany"],"marketDrivers":"Large logistics companies or large carriers are always having a greater chance in becoming the new tech driving force. However, the ultimate drivers should be consumers as if the leading technology will bring positive experience in increasing cargo transparency which benefits revenue, this will become a revolutionary solution among the logistics industry. The challenge is the force inside the industry as we know if issues happened, transparency is always a big concern which makes the conflict.","marketSize":"Market size is to be USD4.4 Billion on IoT & blockchain logistics solution","competition":"The current competition is definitely logistics blockchain solution providers which have been adopted at earlier stage of logistics management, for instance, IOTA. There will also be competitions from famous IoT devices and platform provide such as Honeywell, Siemens etc.","strengthAgainstCompetitors":"Our first-in-the-world sensing device are capable to adopt with logistics blockchain solution provider by embedding their chain keys, which can provide a vertical expansion to the ecosystem. Our uniqueness is that our sensing devices are only capable to decrypt at our self-developed platform.","challengesAgainstCompetitors":"We realise there are industry forces to avoid being too transparent, as we have expected the logistics industry will have a lot of noise against our ‘transparent’ solution. Secondly, logistics blockchain leaders will challenge our private nodes regarding the security level. ","revenueSources":"Revenue sources include hardware sales which are devices and gateways for developers or integrators, project integration which suppose to be one-stop solution starting from site survey to deployment, and recurring service subscription which includes utilisation of our devices and infrastructure.","salesStrategy":"Our sales strategy is to promote our one-stop solution among insurance companies as an entry point which logistics related insurance are with a large revenue portion but they also experienced high risk of claims against carriers and forwarders. Such collaboration will create a high chance of deployment among their upstream logistics customers. Our tentative pricing model is to provide a contract base subscription package starting with USD1,299/month including 100 devices and subscription onwards","traction":"The traction began with a terrible shopping experience by myself which I found out the prawns are smelly when they melt. I believe there are certain technology which can trace the condition, with my IoT experience in smart city I started this field research and how to automate cargo traceability. ","pilotsCustomers":"Our pilot project will be collaborating with Logistics and Supply Chain MultiTech R&D Centre in one of the Hong Kong containers Port to deploy the solution as a demo site among all logistics and marine partners. We will also collaborate with IoT Academy and PortXL in Netherland to deploy in one of their large marine carriers’ port at Amsterdam by the end of 2021, as Netherland is centralised with all the big logistics players no matter marine, freight or train.","metrics":"The quality of our solution including hardware reliability, IoT and blockchain communication stability, data reliability are the major factors what will lead us to the success. Sadly the pandemic issue is pushing our face-to-face promotion and showcasing backward.","howIsCompanyFunded":"Self-funded, and backed by Hong Kong Science Park as an incubatee under Inch-Tech Program","amountRaisedToDate":"0","yourInvestors":"We have not intended to seek investment in Hong Kong or China as our development fund can still survive, cash cow are sensing devices and projects for smart cities at this moment.","fundingObjective":"EUR500K, mainly to recruit talents in Germany or Netherland, and necessary equipment setup to our regional office","numberOfFounders":"1","overallTeamSize":"4","foundersQualification":"Kelvin studied Computer Science at Carleton University, Canada and he granted his Master degree in Executive Management at Royal Roads University. He is familiar in operation management and Business Development and he used to operate decent size manufacturing plants, and with full experience in company and product development.\r\n\r\nHis role in ex-company is the regional Director who’s in charge IoT, wireless charging and renewable energy solution development, he won multiple awards especially 3 consecutive years in winning Geneva Inventions Gold Awards and other innovation awards in Hong Kong, Korea and Singapore.","howImpact":"Logistics industry is a traditional business which do not have a lot of innovative idea on how to apply automation. Hamburg is to be the core logistics hub, as if our solution can be integrated this will become game changer to the logistics industry in making progress totally transparent.","whatDegreeSustainability":"The sustainability of integration is to enhance our sensing devices and traceability connectivity as to optimise our hardware for various commodities, for instance durian traceability system and always-on connectivity method. ","connectionToHamburg":"We have opened the dialogue with Hamburg Invest regarding our intention to seek opportunities and investment, and we are informed to enter this contest by GIC and GCC as our revolutionary solution will definitely help industry.","collaborateWithEntityHamburg":"We have not yet collaborating with any Hamburg entity up till this moment.","howDidYouHearAboutFHA":"Business partner","contactName":"Kelvin Wong","contactPosition":"CEO","contactPhoneNumber":"(852) 540-0909","contactEmail":"kelvin@sensestek.com","companyDeck":[{"type":"pdf","src":["DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-0.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-1.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-10.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-11.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-12.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-13.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-14.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-15.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-16.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-17.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-2.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-3.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-4.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-5.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-6.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-7.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-8.png","DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/optimized_Sensestek new introductory deck 2021-02-FHB-9.png"],"original":"DATA/media/4882273738915227866/deck/Sensestek-new-introductory-deck-2021-02-FHB/Sensestek new introductory deck 2021-02-FHB.pdf"}],"companyLogo":[{"type":"png","src":"DATA/media/4882273738915227866/logo/sensestek-logo-a-1-01/optimized_sensestek-logo-a-1-01.png"}]}