{"id":"4883344404345379551","startupName":"Elestor BV","tagLine":"The Missing Link between Battery Storage and Hydrogen Production","website":"www.elestor.nl","foundingDate":"15-01-2014","stage":"series A","segmentFocus":"B2B","industry":"Energy","headquarters":"Netherlands","startupOverview":"The Elestor technology integrates battery storage and hydrogen production\r\n\r\nElestor BV (25 FTE) introduces electricity storage systems for large scale applications, using Hydrogen Bromine Flow Battery principle. With a patented design, Elestor offers a highly scalable product, featuring storage costs/MWh (LCoS) far beyond conventional technologies.\r\n\r\nIn parallel, the Elestor technology can play an important role in green hydrogen production. Its unique system concept allows integration with electrolyzers, which results in a large increase of electrolyser utilization. This reduces the costs for green hydrogen production significantly. \r\nSee: https://innovationorigins.com/elestor-found-the-egg-of-columbus-for-the-efficient-deployment-of-hydrogen/\r\n\r\nElestor has been recognized with several (inter)national Awards, like the European IDTechEx Award Berlin, for ‘Best Development in Storage Technology’, juried by Fraunhofer Institute, Technical University Berlin and Toyota Motors Europe. ","problemYouAreSolving":"Enabling Electricity Storage & Green Hydrogen Production at the lowest possible cost","productDescription":"The worldwide patented Elestor technology is based on the Hydrogen Bromine Flow Battery principle. Selection of this principle and combining it with the choice for hydrogen and bromine forms the key to ultra low-cost electricity storage (LCoS). Due to using hydrogen as active material in the battery, integration with electrolysers is possible, resulting in maximization of electrolyser utilization, and as such, reduced green hydrogen production costs.","whatMakesYourProductUnique":"The Elestor technology offers unrivalled low storage costs per kWh, enabling realization of viable business cases. An exclusive addittional feature is the possibility to integrate the technology with electrolysers, resulting in a large reduction of green hydrogen production costs.","productReadiness":"Elestor started field testing already in 2016, and succesfully finalized a handfull of pilots under realistic conditions. Currently, the 2nd of a series of 4 pre-production systems are manufactured, after which the technology will become commercially available in the 2nd half of 2021.","productRoadMap":"With a proven, extensively tested and validated technology, Elestor is at the verge of launching its products commercially. This is anticipated for the 2nd half of 2021, and for hich the first 2 contracts with large corporates have been signed. To deal with the large demand for Elestor's technolog, the year 2021 will be in the light of production expansion and automation, to - in a few years - build the equivalent of the Lithium Gigawatt factories for Flow Batteries.","targetMarket":["United States","Australia","Austria","Belgium","France","Germany","Italy","Netherlands","Spain"],"marketDrivers":"The main market driver is the urgency to be able to cover long periods of time during which no renewable energy is generated (dunkelflaute). With a large dependency on sun & wind, large stored capacities rather than large powers are needed.\r\nThe possibility to independently define power & capacity, for a max economic solution, is exactly a unique feature of Elestor !\r\n\r\nThe main challenge Elestor faces is : How to scale up the production capacity and automation of production fast enough !?","marketSize":"The global storage market until 2050 is estimated to be @ 100s of billions€","competition":"- The most direct competitor is the Vanadium Redox Flow Battery. This technology has been commercially available since >1 decade, and is as such established.\r\n\r\n- Secondly, Lithium-ion batteries are aggressively deployed for large scale stationary storage of electricity ","strengthAgainstCompetitors":"Vanadium makes it impossible to keep up with competition in &#039;the race to the bottom&#039; of battery prices. Vanadium is per kWh 20x more expensive than hydrogenbromine. \r\n\r\nLithium batteries have a shorter lifetime and higher LCoS. The Elestor reaches storage costs per kWh of 2 to 3x lower than Lithium.\r\n\r\n","challengesAgainstCompetitors":"No real challenge against Vanadium, as they will fade out due to far too high costs. As these are due to chemical costs, this is a fundamental problem. \r\n\r\nThe challenge with Lithium is that the Elestor technology has to scale fast to benefit from the same economy-of- scale as Lithium already has.","revenueSources":"- Sales of electricity storage systems\r\n- Consultancy / feasibility studies\r\n- Grants and Subsidies\r\n- Investors","salesStrategy":"Elestor is to become a large volume prodution company rather than a low volume project organisation. \r\n\r\nTargeted clients are the larger international companies (corporate), who seek cooperaion with innovative companies to support their roadmap, and who have expressed interest in adopting the technology in large quantities.\r\n\r\nPricing is currently based on actual Li-ion prices for large scale storage. \r\nWith scaling, the Elestor technology pricing can potentially be reduced with a factor of 5.  ","traction":"The commercial traction for Elestor&#039;s technology is very high. The challenge is therefore to identify those market segments in which the unique technology features are economically most meaningful.\r\n\r\nThe Elestor technology excels economically wherever large scale, long duration storage is required.","pilotsCustomers":"Pilots have been done at:\r\n- Witteveen+Bos, Deventer\r\n- Welvaarts, Den Dungen\r\n- ITM Group, Kampen\r\n- Gemeentewerf, Emmeloord\r\n\r\n* It is due to strict NDA embargos not possible to mention the company names of the first large clients. Generally, these are large international corporates.\r\n* Battery power/capacity being discussed ranges from 500kW/3000kWh to 25MW/250MWh.\r\n* Most customers are from Europe, in contact for large systems in Australia (SunCable project) and USA (State of Virginia)  ","metrics":"In essence this is the reduction of Levelized Cost of Storage (LCoS), saying what the actual costs are for storing 1 kWh.\r\n\r\nOther technologies show LCoS of €0,12-0,15 (Lithium) and €0,25-0,30 (Lead acid), thus unable to make storage a business cases.\r\n\r\nWith LCoS of € 0,05, Elestor can do this !\r\n     ","howIsCompanyFunded":"A combination of investors, revenues from projects, and subsidies","amountRaisedToDate":"4000000","yourInvestors":"Enfuro BV\r\nInnoEnergy BV\r\nKoolen Industries BV\r\nDalessi BV ","fundingObjective":"15000000","numberOfFounders":"1","overallTeamSize":"25","foundersQualification":"Wiebrand Kout (CTO) founded Elestor in 2014. In his career Wiebrand pioneered three hydrogen electrochemical systems: the PEM fuel cell, the electrochemical hydrogen compressor and the Elestor HBr flow battery. Prior to founding Elestor, he served as COO and lead designer at HyET, where he co-developed the first electrochemical hydrogen compressor capable of reaching 1,000 Bar in 2013. \r\n\r\nGuido Dalessi (CEO & Investor) joined the company in 2015. Originally a physicist, he has managed companies&#039; growth from the startup phase to becoming global market leader. ","howImpact":"Hamburg anticipates a significant role in green hydrogen production. While Elestor presents a new type of battery, the solution can also contribute to enhance the cost-efficiency of hydrogen production with electolysers.\r\n\r\nThe Elestor technology adds an important variable to a clean energy system.","whatDegreeSustainability":"Sustainability is THE essence of Elestor&#039;s proposition. The technology is developed to contribute to a global, 100% carbonfree, electricity supply, and a such, largely boost the energy transition.","connectionToHamburg":"No, not yet","collaborateWithEntityHamburg":"No. Elestor has, apart for the Netherlands, collaborations in Norway and in Austria.","howDidYouHearAboutFHA":"LinkedIn","contactName":"Guido Dalessi","contactPosition":"CEO","contactPhoneNumber":"(065) 372-9759","contactEmail":"guido.dalessi@elestor.nl","companyDeck":[{"type":"pdf","src":["DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/optimized_Pitch_deck_Elestor_Hamburg-0.png","DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/optimized_Pitch_deck_Elestor_Hamburg-1.png","DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/optimized_Pitch_deck_Elestor_Hamburg-10.png","DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/optimized_Pitch_deck_Elestor_Hamburg-11.png","DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/optimized_Pitch_deck_Elestor_Hamburg-2.png","DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/optimized_Pitch_deck_Elestor_Hamburg-3.png","DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/optimized_Pitch_deck_Elestor_Hamburg-4.png","DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/optimized_Pitch_deck_Elestor_Hamburg-5.png","DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/optimized_Pitch_deck_Elestor_Hamburg-6.png","DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/optimized_Pitch_deck_Elestor_Hamburg-7.png","DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/optimized_Pitch_deck_Elestor_Hamburg-8.png","DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/optimized_Pitch_deck_Elestor_Hamburg-9.png"],"original":"DATA/media/4883344404345379551/deck/Pitch_deck_Elestor_Hamburg/Pitch_deck_Elestor_Hamburg.pdf"}],"companyLogo":[{"type":"jpg","src":"DATA/media/4883344404345379551/logo/Logo_Elestor_PayOff2-(002)/optimized_Logo_Elestor_PayOff2 (002).jpg"}]}