{"id":"4886782725508546006","startupName":"Dashfactory GmbH","tagLine":"Make cycling safer, with dashbike","website":"www.dashbike.de/en","foundingDate":"18.11.2019","stage":"pre-seed","segmentFocus":"B2C and B2B","industry":"Consumer Electronics","headquarters":"Germany","startupOverview":"The number of cyclists is exploding around the world. While its not possible for the cycling infrastructure to grow in the same way. \r\nThe numbers of killed people increase year by year, and also the hit and run accidents. \r\n\r\nWe are a Team of 4 passionated cyclists, with a lot of bad experiences in traffic. So we decided to solve this problem as much as we can. \r\n\r\nOn april first, our safetycam Dashbike will enter the market. Dashbike is much more than a safetycam with a daytime running light. \r\nIt mesures the distance between you and the vehicle overtaking you and helps to improve the cycling infrastructure. \r\n\r\nWe work together with several cities, we tell them about frequented routes, critical spots, and road conditions. All out of our Dashbike. We combine a sensorbox with a product out of the consumer electronic. \r\n\r\nTherefore we have B2C Customers, who buy our product, and B2C Customers, who buy Data. ","problemYouAreSolving":"Legal evidence, because of event-related recordings for cyclists. Better infrastructure for cyclists, because the cities know where to work efficient on bikelanes. ","productDescription":"The Dashbike is a safetycam for cyclists, which just saves event-related clips, to make it legally complient. We are just saving sequences if someone is overtaking with less than 1.5 Meters, or a crash happened. ","whatMakesYourProductUnique":"Our Dashbike is legally safe, because of not permanent filming, just event based. Also we are the first Safetycam who sends your accidential points to your city. ","productReadiness":"We finish the last steps in the next two weeks and go directly into production after that. We are ready to go on the market on April 1st. ","productRoadMap":"To have valid data, we need a big spreading of dashbikes. This is why we work together with several companies in electronics and the cycling branch. Also we sell Dashbikes to several cities. We work together with a big insurance also. ","targetMarket":["Germany"],"marketDrivers":"A market driver is cyqlic at the moment, but they can`t deliver since june 2020. Also for sure a lot of people use different action cams. \r\nSo one main challenge is, to tell the people the difference between a action cam and the dashbike. \r\nThis is why we already work yet a lot on our marketing. ","marketSize":"8.6 billions in germany and 22.1 billions in europe ","competition":"Building a brand. We have the vision, to sell high quality produts to bring more people on bike, because they feel more safe. \r\nDashbike is fully developed and made in germany. Dashbike should be used in every city, to make it easy for cities to plan their infrastructure. ","strengthAgainstCompetitors":"A Team of passionated cyclists, also a former pro cyclist. We have a strong network in cycling. With our team of 8, we have nearly all competences in Software/Hardware/Marketing and Controlling in our Team. Through the collaboration with a electronic store with a lot of branches, we can sell more. ","challengesAgainstCompetitors":"Building up trust for customers and also cities. \r\nWe make together with the city of Leipzig a big marketing campaign in spring this year. To share the advantages of our Pilot project. We also know about the twin project of hamburg, Leipzig and Munich. ","revenueSources":"We sell our Dashbike to private Customers with a price of 229€. \r\nAlso we have different pakages for cities, including workshops, the possibility to buy Dashbikes for their city, or buy data packages. ","salesStrategy":"We are starting with direct sales and in spring 2021 also with our major partners such as Allianz, MediaMarkt, Saturn, Aldi, Lidl, Juggernaut, Marcel Kittel, Eric Lesser, Team Bora Hansgrohe, Stadt Jena, Stadt Leipzig.\r\nPricing: \r\nThe sale of hardware devices with an profit margin of 73%+ \r\nAn individual monthly fee for the data by the cities and health insurance companies.\r\nAn individual monthly fee for arranging insurance and insurance services \r\nCLV in total in average: EUR 800 / customer.\r\n","traction":"Traction through first two cities as customers: City of Leizig, City of Jena. \r\nTraction through cyclists: Over 1.500 Newsletter registrations without any Marketing. \r\nPartners: Allianz, MediaMarkt, Saturn, Aldi, Lidl, Juggernaut, Marcel Kittel, Eric Lesser, Team Bora Hansgrohe.","pilotsCustomers":"in B2B/B2B2C: City of Leizig, City of Jena, Allianz, MediaMarkt, Saturn, Aldi, Lidl\r\nin B2C: 1.500+ Cyclists through our network and direct sales until now without marketing. ","metrics":"EUR 1 Mio.+ in capital\r\nTeam of 10\r\nEUR 10.000+ through workshops \r\n1.500+ customers without marketing \r\nHuge partners and great network ","howIsCompanyFunded":"equity, convertible loan (VC & BA)","amountRaisedToDate":"1050000","yourInvestors":"Beteiligungsmanagement Thüringen (bm-t)\r\nMitteldeutsche Beteiligungsgesellschaft (MBG) \r\nUS-American Business Angel (J. Fritz) ","fundingObjective":"2500000","numberOfFounders":"2","overallTeamSize":"10","foundersQualification":"Studied Sportmanagement & Law. \r\nLelia: Pro MTB-Cyclist, Cycling Influencer and Cycling Blogger with over 14000 Followers and huge cycling network and valuable contacts. \r\nSandro: best connected, 14 years athlete coach in Bundesliga and UCI MTB-Worldcup races. Brother of former rider of German National cycling Team and 3rd German Champion. ","howImpact":"Dashbike improves the safety and visibility of cyclists immediately and contributes to an effective data-based improvement of the infrastructure together with cities and thus enables up to • 29% less traffic fatalities • 50% less traffic jam • 92% less CO2 • 12x more parking and traffic space.","whatDegreeSustainability":"Sustainability is very important to us. We develop in Germany, produce in Germany and use one hardware for many products and services per update. Quality, durability and environmentally friendly packaging are a matter of course for us. Also it is our goal to get more people on bike! ","connectionToHamburg":"We have connections to Hamburg via our first pilot partner, the city of Leipzig, which is also involved in improving the cycling infrastructure in cooperation with Hamburg and Munich. We are also part of the EIT UM Accelerator, whose network also includes Hamburg. ","collaborateWithEntityHamburg":"We have many customers from Hamburg (B2C) in our list who contact us regularly.","howDidYouHearAboutFHA":"Facebook","contactName":"Lelia König","contactPosition":"CEO","contactPhoneNumber":"(049) 176-4426","contactEmail":"lelia.koenig@dashfactory.de","companyDeck":[{"type":"pdf","src":["DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --0.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --1.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --10.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --11.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --12.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --13.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --2.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --3.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --4.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --5.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --6.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --7.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --8.png","DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/optimized_2020_12_07 EIT UM - Dashfactory --9.png"],"original":"DATA/media/4886782725508546006/deck/2020_12_07-EIT-UM-Dashfactory-/2020_12_07 EIT UM - Dashfactory -.pdf"}],"companyLogo":[{"type":"png","src":"DATA/media/4886782725508546006/logo/dashfactory-png/optimized_dashfactory png .png"}]}