{"id":"4892030554712687684","startupName":"R8tech","tagLine":"Artificial Intelligence taking buildings to the next generation.","website":"https://www.r8tech.io","foundingDate":"2017/03","stage":"seed","segmentFocus":"B2B","industry":"Real Estate & Facilities Services","headquarters":"Estonia","startupOverview":"Commercial buildings face serious HVAC-related  energy efficiency and cost challenges due to the complex nature of state-of-the-art Building Management Systems (BMS) and the limits of human building operators. This leads to energy-waste, makes it difficult to detect HVAC (Heating-Ventilating-Cooling) errors as well as pollutes the indoor climate and causes in long term severe health issues.  \r\nR8tech has developed an Artificial Intelligence (AI)-based diagnostics and indoor climate control software solution for commercial buildings with BMS that brings 10-30% energy savings and lower CO2, improves indoor climate and simplifies fault and anomalies detection. Our AI makes your BMS operations thousands of times more effective by calculating and adjusting the HVAC system setpoints every 15 minutes 24/7/365.\r\nFounded in Estonia by 4 co-founders with different skills and experiences, R8tech is active in 12 countries and over 650.000m2 of commercial buildings are connected.","problemYouAreSolving":"Commercial buildings face HVAC-related  energy efficiency & cost challenges due to the complex nature of state-of-the-art Building Management Systems (BMS) and the limits of human building operators. This leads to energy-waste, makes it difficult to detect HVAC errors and pollutes the indoor climate","productDescription":"R8 Digital Operator – the first web-based and AI-driven software for real estate managers. Our solution enables clients to take intelligent and automated control over their HVAC systems 24/7 and achieve energy costs savings and CO2 emission reduction up to -30%, improve HVAC transparency and stability with novel fault diagnostics features. R8tech ensures that the buildings are heated, cooled and ventilated at the right time, with the right amount of energy.","whatMakesYourProductUnique":"It is easy to remember about the R8 Technologies unique value: Remote Setup (without additional hardware), no obligation for a new User Interface, offering Results instead of monitoring or analytics and finally - results oriented pricing with money back quarantee.","productReadiness":"R8tech SaaS - R8 Digital Operator is in use in over 650.000m2 of shopping malls, hotels and office buildings in 7 countries already. Customers' geography and amount is growing (totally 12 countries are covered by area managers and clients now).","productRoadMap":"We started to develop the solution in 2016; in 2017 R8tech was founded and 2 first test buildings connected (Swedbank – No1 bank in the Baltics – HQ and a 32.000m2 shopping mall in Tallinn). In June 2018 we signed the 1st investment contract and started to grow. For the end of 2019 we were technically ready to scale. In 2020 we started active sales and the 1st buildings outside Estonia integrated. 2021 goal is to grow 5 times in sales revenue compared to 2020.","targetMarket":["United States","Austria","Belgium","Bulgaria","Chile","Colombia","Czech Republic","Denmark","Estonia","Finland","France","Germany","Greece","Hungary","Ireland","Italy","Latvia","Lithuania","Luxembourg","Netherlands","Norway","Peru","Poland","Portugal","Slovakia","Slovenia","Spain","Sweden","Switzerland","Turkey","United Arab Emirates","United Kingdom"],"marketDrivers":"The biggest challenge is to make very conservative commercial real estate sector more open to new advanced technologies. The whole proptech community is working this direction and it is opening already. Also - C19 has been called \"the last wake-up call for CRE sector\".","marketSize":"20% of 5 Billion m2 of commercial buildings in EU cities.","competition":"We use 2 verticals to compare the smart building solutions market: \r\na) from 100% hardware to 100% software;\r\nb) from 100% monitoring/analytics/consulting to 100% autonomous control.\r\nIn the sector or 100% software/100% autonomous control there are very few companies incl R8tech. ","strengthAgainstCompetitors":"It is easy to remember about the R8 Technologies most unique strengths: Remote Setup (without additional hardware), no obligation for a new User Interface, offering Results instead of monitoring or analytics and finally - results oriented pricing with money back quarantee.","challengesAgainstCompetitors":"We have to be better than local service providers and it has to be easy to understand. Often other solutions&#039; providers present \"we do exactly the same thing or even better\" and sure their clients believe them in spite of real facts that there can be no similarities at all, even no competition :)\r\n ","revenueSources":"R8tech main revenue source is our client portfolio. We offer 2 main services: \r\na) Diagnostics - to detect HVAC-systems and BMS anomalies and faults based on data;\r\nb) R8 Digital Operator (Diagnostics + Autpilot). Adding energy optimizer and indoor climate improving to the continuous diagnostics.\r\n","salesStrategy":"Sales strategy: our main focus is CRE portfolio companies (owners and managers). After a successful pilot the solution can be launched to a bigger part of each portfolio.\r\nPricing model: we earn from the value that we offer. While improving the indoor climate as the priority No.1 we earn from energy savings based on sharing savings(incl normalization - removing weather impact) of monthly fixed fee per m2.","traction":"Over 650.000m2 of commercial buildings (shopping malls, office buildings, hotels) are integrated to R8tech. Clients&#039; geographical locations: Finland, Estonia, Portugal, Latvia, Lithuania, Luxemburg. \r\nR8tech area managers cover: DACH, Netherlands, Finland, Norway, Portugal, Poland, Czech, Lat-Am.","pilotsCustomers":"WeWork (in Paris, FRA); Radisson BLU (in Helsinki, FIN); CBRE (in Helsinki, FIN); EDP (in Coimbra, POR); EIKA (in Vilnius, LIT); Encevo (in Luxemburg); Linstow (in Tallinn, EST); Northern Horizon (in Riga, LAT); RIMI (in Marupe,LAT); EfTEN (in Tallinn, EST); Technopolis (in Tallinn, EST); Estiko Group (in Tartu, EST); Tallinn City Government (in Tallinn, EST); Estonian State RE (in Tallinn, EST); Aalto University (in Espoo, FIN) etc.","metrics":"Beside regular financial metrics:\r\n*Number of m2 connected to R8tech;\r\n*Energy savings compared to base month (normalized = weather impact removed); \r\n*Indoor climate % of target during building usage time; \r\n*Reduced CO2 in t compared to base month (normalized). ","howIsCompanyFunded":"Investment rounds in 2018, 2019 and 2020.","amountRaisedToDate":"2500000","yourInvestors":"2018: Pontos OY from Finland;\r\n2019: Lemonade Stand from Estonia;\r\n2019: Tehnohaldus from Estonia;\r\n2020: 5 more investors from Estonian construction and RE sectors.","fundingObjective":"0","numberOfFounders":"4","overallTeamSize":"19","foundersQualification":"Siim Täkker (MSc), \r\nHVAC and energy systems engineer with over 10 years of experience in different fields. \r\nImre-Gustav Vellamaa (MA), \r\nOver 25 years of professional management experience in various roles linked to international SME commerce and trade. \r\nAhmet Köse (PhD), \r\nControl systems engineer with over 12 years of research experience in computational and artificial intelligence, designing control of complex systems and system modelling. \r\nImre Purret (MSc),\r\nBackend developer and data systems architect with over 10 years of experience in building reliable software solutions in complicated data-intensive businesses.\r\n\r\n","howImpact":"R8tech can take Hamburg&#039;s commercial buildings&#039; technical management to the next generation by ensuring highest indoor climate comfort and energy efficiency with Artificial Intelligence on top of the existing automation systems. Sustainability goals can be achieved without any additional investment ","whatDegreeSustainability":"Our business model relies 100% on sustainability degree. If we can not achieve value – no money for us and good bye! ","connectionToHamburg":"R8tech does not have any business connection to Hamburg unfortunately yet.  \r\nR8tech co-founder Imre-Gustav Vellamaa has visited Hamburg several times since 1989 (his 1st trip to abroad at all). Also waiting for Hamburger SV to promote to Bundesliga again (seems they will do it this year) :)","collaborateWithEntityHamburg":"R8tech does not have any cooperation in Hamburg unfortunately yet.","howDidYouHearAboutFHA":"LinkedIn","contactName":"Imre-Gustav Vellamaa","contactPosition":"Board Member","contactPhoneNumber":"(372) 502-6050","contactEmail":"imre.vellamaa@r8tech.io","companyDeck":[{"type":"pdf","src":["DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-0.png","DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-1.png","DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-10.png","DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-11.png","DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-12.png","DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-2.png","DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-3.png","DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-4.png","DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-5.png","DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-6.png","DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-7.png","DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-8.png","DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/optimized_R8 Presentation 20210208 ENG IG-9.png"],"original":"DATA/media/4892030554712687684/deck/R8-Presentation-20210208-ENG-IG/R8 Presentation 20210208 ENG IG.pdf"}],"companyLogo":[{"type":"jpg","src":"DATA/media/4892030554712687684/logo/Digital-Operator-Robot/optimized_Digital Operator Robot.jpg"},{"type":"jpg","src":"DATA/media/4892030554712687684/logo/Logo-R8tech-black/optimized_Logo R8tech black.jpg"},{"type":"jpg","src":"DATA/media/4892030554712687684/logo/foto-IGV1/optimized_foto IGV1.jpg"}]}