{"id":"4894827826616008766","startupName":"BusDine","tagLine":"Order and enjoy a tasty meal on the bus.","website":"www.busdine.com","foundingDate":"Not yet registered","stage":"pre-seed","segmentFocus":"B2B2C","industry":"Software & Information Technology","headquarters":"Germany","startupOverview":"BusDine is the first-ever app by which long-distance bus travellers can order food and get it delivered at the next bus stop and enjoy the meal on their journey ahead. Unlike flight and train, bus travellers don’t have the luxury to have a tasty meal during the journey. There are limited places to grab a meal at bus stops and travellers remain hungry on the long journey. Hence, BusDine is starting in Germany and Austria to provide bus stop food delivery service across major long-distance bus routes. \r\n\r\nWe are targeting the intersection of food delivery and the long-distance bus travel market. We have the first-mover advantage to capture a high market share.\r\n\r\nShivam (Founder) will be working for the development of the mobile apps required for the project. Liesa (Founder) will be working for marketing and sales for establishing B2B business partnerships with restaurants. Gaurav (Founder) will be managing logistics and operations for the project .\r\n","problemYouAreSolving":"On customer side we are solving the unfulfilled demand of hungry long distance bus travellers. On business side we are solving the problem of inconsistent demand of food orders.","productDescription":"On customer side we are solving the unfulfilled demand of hungry long distance bus travellers. On business side we are solving the problem of inconsistent demand. We are boosting the operation capacity of deliveries of each restaurant as multiple orders have to be delivered at a single location.","whatMakesYourProductUnique":"We use using 3 AI technologies which enhance our product. We use machine learning to accurately predict bus arrival using passenger location, live traffic data and bus location API. Apart from arrival prediction, we are using AI for demand prediction and dynamic pricing for maximising the sales. ","productReadiness":"So far, for our B2B2C business model, we conducted research to understand and validate the demand on the customer (bus passenger) side and also on the business (restaurant) side. Currently we are working on development of software architecture and logistic framework for operations.","productRoadMap":"As per our estimated timeline, for the development of product and business relations, we expect to launch BusDine to market in October 2021. We have divided our project into multiple phases for product development, sales, marketing, and logistics.  After our launch in October 2021, our goal is to sign 250 B2B restaurant partnerships in 25 cities by January 2023.  ","targetMarket":["Austria","Germany"],"marketDrivers":"We analysed statistics reports to determine the market size of platform to consumer food delivery, which was worth 2747 million € in 2019 as per Statista reports. 62 million passengers traveled through Flixbus, a 37% increase to 2018. As per market patterns, both the food delivery and bus mobility market are growing rapidly.\r\n\r\nOur predicted challenges will me majorly operation due to our innovative product and being first in the market. ","marketSize":" Serviceable available market (SAM): 13.76 million","competition":"We are not challenged with direct competitors providing the same or similar service to the market we are targeting. However, some of the existing market of 13.76 million people have their way of self-serving. Passengers can have some food along or buy a small snack at a kiosk if available. ","strengthAgainstCompetitors":"We will be targeting bus stops that do not have any form of shops to grab a snack from. Thus, eliminating a form of indirect competition. ","challengesAgainstCompetitors":"It would be difficult to change the behaviour of passengers who might be hesitant to eat during a long distance bus ride. However with attractive offers and deals, we can solve the challenge and occupy a higher share of our market.","revenueSources":"BusDine’s revenue will come from the sale of restaurant onboarding packages, commission charged on orders, and monthly subscription fee.","salesStrategy":"We will sign a 1-year operational contract with each of our partner restaurants starting in October 2021. 10% commission per order and 399 € monthly subscription fee will be charged to our restaurant partners.","traction":"We believe that offering an innovative product for unfilled demand provides us with an edge to generate traction. From the start of the project till the product launch, we allocate time and resources constructing the product and simultaneously testing traction channels in parallel. ","pilotsCustomers":"Our focus is to capture the market of Gen Z and millennials as first users. This will help us to reach a higher product adoption by having a young audience as early adopters of BusDine. Initially, our customer group would arise from post-pandemic surge travel including vacation travelers, commuters, backpackers, etc. \r\n \r\nOur customers also include restaurants as business providers. Our choice is to partner with small restaurants and cloud kitchens within a 2 km radius of bus stops.\r\n","metrics":"Pre-launch:\r\n \r\n1. Partner restaurants\r\n2. Cities covered\r\n3. Email signups\r\n4. Blog / Instagram content shares\r\n \r\nPost-launch:\r\n \r\n1. App downloads\r\n2. Customer referrals\r\n3. Monthly active users\r\n4. Monthly revenue\r\n5. Monthly orders\r\n6. Customer satisfaction rating\r\n7. Blog / Instagram content shares\r\n","howIsCompanyFunded":"Currently raising funds through grants","amountRaisedToDate":"0","yourInvestors":"We are currently in second stage of 2 government grants for seeking approval of funding. ","fundingObjective":"130.000","numberOfFounders":"3","overallTeamSize":"3","foundersQualification":"Shivam is the founder of BusDine. He is responsible for engineering, product development, and business development at BusDine. Shivam studied International Business Administration and Computer Science at Jacobs University Bremen. He has been working in Hamburg for 2 startups. There he got the opportunity to understand the business operations. He simultaneously improved his programming skills working as a website and mobile applications developer. With skills in app development, business administration, and artificial intelligence, Shivam will be leading the engineering and business strategies of BusDine.","howImpact":"Our startup will play a major role in digitalising and boosting sales of restaurants in Hamburg. We are creating an infrastructure to empower not just Hamburg but cities and towns across Germany and Austria.","whatDegreeSustainability":"UN SDG 12: Responsible consumption & production \r\n \r\nRestaurant conditions: \r\n\r\n1. Use of recyclable cornstarch packaging\r\n2. Use of recyclable kraft paper instead of plastic \r\n3. Offering vegetarian/vegan food options\r\n\r\n \r\nFrom our start, we want to grow sustainably keeping pollution as low as possible. \r\n","connectionToHamburg":"After studying in Bremen, I moved to Hamburg. I have worked at startups in Hamburg and familiar with the startup scene of Hamburg. ","collaborateWithEntityHamburg":"Not yet.","howDidYouHearAboutFHA":"Instagram-Ads","contactName":"Shivam Goraksha","contactPosition":"Founder","contactPhoneNumber":"(017) 923-2711","contactEmail":"shivam.busdine@gmail.com","companyDeck":[{"type":"pdf","src":["DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -0.png","DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -1.png","DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -10.png","DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -11.png","DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -12.png","DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -2.png","DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -3.png","DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -4.png","DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -5.png","DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -6.png","DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -7.png","DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -8.png","DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/optimized_BusDine Pitchdeck -9.png"],"original":"DATA/media/4894827826616008766/deck/BusDine-Pitchdeck/BusDine Pitchdeck .pdf"}],"companyLogo":[{"type":"png","src":"DATA/media/4894827826616008766/logo/logo/optimized_logo.png"}]}