{"id":"4894905778129178564","startupName":"Geckomatics","tagLine":"AI Powered Mobile Mapping","website":"geckomatics.com","foundingDate":"2018","stage":"pre-seed","segmentFocus":"B2B2G","industry":"Software & Information Technology","headquarters":"Belgium","startupOverview":"Geckomatics solves the scarcity of geographical information despite growing demand by automating processes and productising a traditional service industry. We do this by redesigning the geodata acquisition process with AI in the cloud, making our product very scalable, very fast, flexible and with disrupting functionalities. Our technology is able to create professional grade maps faster, better and cheaper. In addition to traditional mappers, we can make automatic inventories of valuable assets to improve management and city liveability: trees, pavement quality, traffic signs, street furniture etc can be digitised in order to create more efficient management and ultimately improve urban living. In effect, we make a true digital twin of public space. Our technology is applied in a growing number of countries. The founders have proven business and technology accumen and are building a great team and business","problemYouAreSolving":"In spite of growing demand, incumbents are unable to supply adequate geodata, This is a multi billion dollar opportunity cost","productDescription":"360ยบ camera imagery made by our customers is processed with AI on our cloud to make a digital twin and extract actionable information. The hardware is easy enough to use by anyone and very efficient and scalable","whatMakesYourProductUnique":"We automate processes that are traditionally slow, expensive an labour intensive. Native AI opens up unknown possibilities like fast 3D modelling, object inventories, anomaly detection etc ","productReadiness":"TRL7 - Product in use in real environment. We have paying customers in several countries","productRoadMap":"We are at working prototype stage starting rollout with real paying customers. Next will be production grade product on a small scale (dozens of customers). Then large scale (hundreds to thousands)","targetMarket":["United States","Argentina","Australia","Austria","Belgium","Brazil","Canada","Chile","Colombia","Cyprus","Denmark","Estonia","Finland","France","Germany","Greece","Greenland","Hong Kong","Iceland","Ireland","Israel","Italy","Japan","South Korea","Liechtenstein","Lithuania","Luxembourg","Mexico","Monaco","Morocco","Netherlands","New Zealand","Norway","Peru","Poland","Portugal","Spain","Sweden","Switzerland","Turkey","Ukraine","United Arab Emirates"],"marketDrivers":"The market for geodata is growing at 15% CAGR. Smart Cities and Road Authorities, our two target verticals, are growing faster. At the same time, incumbents are unable to keep up due to limited scalability (need for mapping hardware and fleet, manual labour, limited technology). We create a product that is attainable, scalable and powerful enough to produce the desired data more efficiently. Challenge: a big part of the market is government related, meaning often long tenders","marketSize":"TAM 4 bn, SAM 800 M, SOM 80 M","competition":"Two types of competitors: \r\n1) Freebies (google streetview etc): insufficient quality for professional users. 2) Hi end boutique mappers: very high data quality, but expensive, slow and limited features. Due to cost, updates are not made frequently, leading to obsolete, incomplete and missing data\r\n","strengthAgainstCompetitors":"We are a 1 stop shop from data acquisition hardware to final processed data. The product is easy to use because software does the hard part in the cloud. Thanks to automation, our tech is very scalable, offering economies of scale and faster production. AI native means innovatieve functionalities","challengesAgainstCompetitors":"At the moment we believe our product is the most advanced in existence in our category, so of course we intend to keep that leadership position. This requires fast market adoption as well as external funding.\r\nThis is not an existential threat yet because incumbents are not easily going to copy us","revenueSources":"Paying customers, mainly city authorities but also some private companies.","salesStrategy":"Our GTM is through value adding resellers. We have partnerships with Microsoft (Western Europe, targeting cities and road authorities), Arcadis (pavement quality studies), Geoda (Israel and LatAm).\r\nOur pricing is straightforward and SaaS based: customers pay for a license to access processed data per km mapped, with additionally options for specific intelligence (like asset inventories). Since geodata naturally ages and needs to be updated regularly, this is a recurring business.","traction":"Currently pretty busy with customers, and showing nice traction. We are beating incumbents in public tenders. Geckomatics has been discovered by Microsoft who are proposing our technology to their municipal customers in Western Europe. We are taking on some big players in large public tenders","pilotsCustomers":"Yes, we have done pilots and have customers. We have performed a pilot with Siemens in Lisboa for example","metrics":"Public tenders won that we participated in so far: 3/4. ","howIsCompanyFunded":"Bootstrapped + loans (no equity investors yet)","amountRaisedToDate":"350000","yourInvestors":"Crowd","fundingObjective":"1000000","numberOfFounders":"2","overallTeamSize":"6","foundersQualification":"CEO: 18 years of experience in technology environments, leading complex projects with large teams. MBA and large international network. Gets things done and is able to pick top talent.\r\nCTO: data scientist with 8 years of experience in developing groundbreaking algorithms, some of which are still in operation with companies like Uber. \r\nAdvisor/CFO: one of Belgium&#039;s top tech entrepreneurs, having been involved in over 60 companies either as founder, CEO, investor or advisor. Global network","howImpact":"A unique feature of our technology is to efficiently create inventories of assets like trees, but also gain insight that helps mobility management, pavement quality etc. The kind of data we generate is instrumental in improving urban living in many ways because it is the basis of modern city mgmt","whatDegreeSustainability":"One of the things we do is create inventories of urban trees. Trees are very valuable assets for cities: aesthetics, health, environmental. They help reduce noise, dust, wind. They help cool cities in summer, limiting energy use,  capture carbon. Better tree management means a more sustainable city","connectionToHamburg":"Not yet, but we would love to :-) ","collaborateWithEntityHamburg":"No","howDidYouHearAboutFHA":"LinkedIn","contactName":"Bert Cattoor","contactPosition":"Geckomatics","contactPhoneNumber":"(324) 865-8110","contactEmail":"bert.cattoor@geckomatics.com","companyDeck":[{"type":"pdf","src":["DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-0.png","DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-1.png","DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-10.png","DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-11.png","DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-12.png","DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-2.png","DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-3.png","DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-4.png","DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-5.png","DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-6.png","DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-7.png","DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-8.png","DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/optimized_Geckomatics_Future Hamburg-9.png"],"original":"DATA/media/4894905778129178564/deck/Geckomatics_Future-Hamburg/Geckomatics_Future Hamburg.pdf"}],"companyLogo":[{"type":"png","src":"DATA/media/4894905778129178564/logo/Geckomatics_tagline/optimized_Geckomatics_tagline.png"}]}