{"id":"4895742488999476383","startupName":"Vulvani","tagLine":"Let if flow!","website":"https://vulvani.com/","foundingDate":"2021/02","stage":"pre-seed","segmentFocus":"Generation Y & B2B","industry":"Education","headquarters":"Germany","startupOverview":"The Vulvani Academy is an online education marketplace around menstruation, sexuality and female health. Through our app and website, we are talking about topics that others prefer to keep quiet about. We transform uncomfortable topics into a digital educational product that is fun to use (educate + entertain = edutain). Through interactive e-learning courses, users can playfully close knowledge gaps about the female body. This removes taboos surrounding the subject and enables a positive education of society. \r\nOur mission is to normalize socially tabooed subjects surrounding the female body through entertaining and gamified education to empower people and create inclusive societies. We have a helpful bilingual online magazine (15k page views, rapidly growing), 4k social network and launched helpful tools like a free stock photo gallery about menstruation.\r\nWe are Britta Wiebe M.A., experienced lecturer and period expert and Jamin Mahmood, serial entrepreneur.\r\n","problemYouAreSolving":"Taboo and lack of knowledge of menstruation, sexuality and the female body.","productDescription":"The Vulvani Academy is a digital education platform around menstruation, sexuality and female health. Through our app and website, we are talking about topics that others prefer to keep quiet about. We transform uncomfortable topics into a digital educational product that is fun to use (educate + entertain = edutain). Through interactive e-learning courses, users can playfully close knowledge gaps about the female body. This removes taboos and enables a positive education of society.","whatMakesYourProductUnique":"There’s no central digital hub for learning about the female body. Some people are gaining their knowledge through self-study and scattered sources on the internet. Alternatively people are reading books, learning from their parents or friends.","productReadiness":"Launch of the first courses in Q2 2021. We have built up a tremendously great and supporting community in various channels.","productRoadMap":"Over the course of the year, we will launch a total of five online courses for Generation Y&Z and additional online courses for companies in 2022. Essential in the further development of the Vulvani Academy is the ongoing course expansion. That is why we are opening up as a marketplace by 2023 at the latest. With these measures, the Vulvani Academy has the potential to become a global and scalable center of excellence around the female body.","targetMarket":["Germany"],"marketDrivers":"At the launch of the product, the main risk is that too few B2C customers will be attracted. Topics relating to women&#039;s health must be treated very sensitively to avoid misinformation. Another challenge is high-quality management to ensure the accuracy of the content of the online courses offered (externally and internally). In the medium term, increasing user activity is a crucial factor, since if activity is too low, the affordable prices cannot be maintained.","marketSize":"Potentially 51% of people who identify as female within Generation Y.","competition":"There is no global e-learning marketplace around female health.\r\nPlatforms such as Udemy have many courses in the software area, but offer only limited educatio on female health.\r\nIn terms of content, there are smaller digital course creator. However, these are often expensive and not scalable.","strengthAgainstCompetitors":"We start with German and English and consistently expand the online course and language variety. Our online courses are gamified, fun and break taboos.","challengesAgainstCompetitors":"Since we are still very young, we have to compete against larger platforms that already have a large reach. Even if they only offer very limited online courses on female health.","revenueSources":"Our business model is based on selling online courses. They are either self-created, co-created or developed by external creators (comission based). We also run an online store with affiliates or dropshipping as well as our lovingly designed Vulvani merchandise.","salesStrategy":"Private individuals pay 29€ per course (based on the price willingness from our\r\nsurvey). Here, however, we are at the lower end of the willingness to pay in order to keep the entry thresholds as low as possible.\r\nFor companies, an annual access for all online courses per employee is 99€ from\r\nten accesses. Parents purchase an annual access for all online courses for their children for 49€ (Generation Alpha typically are the children of Generation Y - Upselling potential).","traction":"Our focus last year was on building our brand.\r\nWe have a bilingual online magazine with over 70 SEO-optimized helpful articles and interviews, generating 15,000 organic page views per month.\r\nIn social networks, we are currently accompanied by 4,000 followers and experts. Three LOIs.","pilotsCustomers":"We are currently in development, have an MVP and will start with the beta version of the Vulvani Academy in Q1 2021. There are already many pre-registrations and newsletter contacts for this.","metrics":"Our organic reach is growing day by day. This allows us to introduce Vulvani Academy to a wide audience from the very beginning. Furthermore, we were already able to generate a lot of PR attention through various viral marketing actions.","howIsCompanyFunded":"Bootstrapped","amountRaisedToDate":"0","yourInvestors":"No investors yet. We will start to look for investors after we launched the first courses.","fundingObjective":"250000","numberOfFounders":"2","overallTeamSize":"4","foundersQualification":"Britta Wiebe, M.A.: Lecturer, political education consultant and teacher (German as a foreign language) in various countries. Management of research projects on female health as a research associate. Expertise in marketing and conception of educational educational formats.\r\nJamin Mahmood, dual B.A.: After almost five years at Shell with assignments in Marketing, Sales, Finance and as Network Planning Analyst, dedication to the startup scene as multiple founder in E-Commerce, Gastronomy, Design. Winner of the German Gastro Founder Award 2018. Tech Enthusiast.\r\n","howImpact":"Vulvani Academy supports the society and the de-tabooing of the female body. Normalization leads to more research and closes the Female Health Data Gap, which leaves female diseases, such as endometriosis, undiagnosed for years and\r\ntreatment options are lacking.","whatDegreeSustainability":"Vulvani Academy supports four of the UN&#039;s 17 Sustainable Development Goals (health and well-being, quality education, gender equality, fewer inequalities) and thus creates an important contribution to a more equitable world and Hamburg.","connectionToHamburg":"We are based, working and living in Hamburg.","collaborateWithEntityHamburg":"Member of Hamburg Startup Club.","howDidYouHearAboutFHA":"Digital article","contactName":"Jamin Mahmood","contactPosition":"Founder","contactPhoneNumber":"(015) 785-0640","contactEmail":"jamin@vulvani.com","companyDeck":[{"type":"pdf","src":["DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/optimized_Future Hamburg Award Pitch Deck-0.png","DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/optimized_Future Hamburg Award Pitch Deck-1.png","DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/optimized_Future Hamburg Award Pitch Deck-10.png","DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/optimized_Future Hamburg Award Pitch Deck-11.png","DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/optimized_Future Hamburg Award Pitch Deck-2.png","DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/optimized_Future Hamburg Award Pitch Deck-3.png","DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/optimized_Future Hamburg Award Pitch Deck-4.png","DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/optimized_Future Hamburg Award Pitch Deck-5.png","DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/optimized_Future Hamburg Award Pitch Deck-6.png","DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/optimized_Future Hamburg Award Pitch Deck-7.png","DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/optimized_Future Hamburg Award Pitch Deck-8.png","DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/optimized_Future Hamburg Award Pitch Deck-9.png"],"original":"DATA/media/4895742488999476383/deck/Future-Hamburg-Award-Pitch-Deck/Future Hamburg Award Pitch Deck.pdf"}],"companyLogo":[{"type":"jpg","src":"DATA/media/4895742488999476383/logo/Vulvani-Logo-Quadrat/optimized_Vulvani Logo Quadrat.jpg"}]}