{"id":"4896334332146761226","startupName":"Skipit","tagLine":"Go Explore","website":"www.skipit.cc","foundingDate":"12/2019","stage":"pre-seed","segmentFocus":"B2C","industry":"Transportation & Logistics","headquarters":"Denmark","startupOverview":"Pre pandemic 116 million tourists and travellers visited Europes top destinations, causing city numbers to swell substantially However this target group have a recurring theme: A lack of access and understanding of local public transport network&#039;s. This results in them choosing private transport modes and creating further congestion and pressure on local infrastructure, this number is set to double by 2030.\r\n\r\nAs this market begins to slowly return in mid 2021, we want to stage an intervention, and address this paradox. Thats why we are on a mission to allow everyone to travel like a local in a new city. Providing our community with a global and digital smart card to easily pay for public transportation. \r\n\r\nWe are a mix gendered group of founders and have already onboarded multiple public transport networks throughout Europe to be an official third party seller of their tickets. We hope to add Hamburg to this list, as continue our mission to allow everyone to travel like a local. ","problemYouAreSolving":"The tourism and travel numbers are set to double by 2030. And yet public transport network's, have very little budget or mandate to help this target group use their service. We need to include this underserved and overlooked target group within the green transition's of our cities.","productDescription":"Our product provides has three key pillars: 1) At the foundation a smart digital card, that allows users to simply pay for public transport no matter their location in the city. 2) A 'neighbourhood inspiration feed'- with an aim to nudge the expenditure of travellers to reach the various neighbourhoods of a city. 3) A city based chatbot allowing users to have there FAQ's regarding urban mobility answered in real time. ","whatMakesYourProductUnique":"We offer a flexible pay as you go, cross boarder solution for paying for public transport in cities across Europe. With the ability to load money on this digital card and exchange it between currencies, depending on the city and country you are in. ","productReadiness":"In 2020 we postponed our product launch due to Covid-19. However we have our product ready to launch. And will be launching our full service in Helsinki, Finland within the next 2 months. And during 2021 will be incorporating further cities into the platform, to help everyone travel like a local. ","productRoadMap":"Over the next two years we plan to focus soley on our core service, our 'Skipit card' and partnering with as many public transport networks as possible. However we also seer the opportunity to build a B2B2C platform for local businesses to directly promote themselves to our group of travellers, and further in the future start to work with local governments, public transport companies and urban planners, to offer data sets and be part of building the green cities of the future. ","targetMarket":["Denmark","Finland","France","Germany","Hungary","Italy","Netherlands","Poland","Portugal","Spain","Sweden","Switzerland","United Kingdom"],"marketDrivers":"The Market has obviously been affected by Covid-19, as is its current biggest challenge however as the market returns we see a number of current trends amongst our target group. \r\n\r\n1) Demand to travel like a local\r\n2) Demand to fight climate change\r\n3) Demand to experience more authenticity whilst traveling.  \r\n\r\n\r\n","marketSize":"15.64 billion Euro","competition":"Our competition includes some of the worlds biggest players within urban mobility: Google maps, CityMapper and Whim. All currently focused on MaaS or mobility as a service and monthly subscriptions to mobility options. \r\n","strengthAgainstCompetitors":"We offer a pay as you go alternative, as our target group on average stay in a city for 2-3 days, it makes no sense for them to be tied to a subscription based service. Furthermore none of them directly target tourists and travellers.","challengesAgainstCompetitors":"The spending power naturally outweighs our own, and  current customer base, is a challenge for us.  ","revenueSources":"Our business model is based on commission from ticket sales of the public transport network&#039;s and a 1Euro top up fee, every time an individual loads money onto their card. ","salesStrategy":"We currently reach our target group through our strategic partnership with destination offices and hotel groups, as well as public transport providers. The pricing of model around the 1Euro &#039;top up fee&#039; is based on our ability to save time and inconvenience for our target group. ","traction":"We currently have 9 of our 18 target cities, public transport networks across Europe who have granted us access to their ticketing API&#039;s. \r\n\r\nWe have also established partnerships with multiple hotel groups and destination offices that allow us to onboard our community onto the app. \r\n","pilotsCustomers":"We currently have tested our MVP on a small target group but have postponed the launch sue to Covid 19. However we will go live in our first city Helsinki within the coming months. And after this we have permission to enter into new markets across the continent","metrics":"Partnerships- Without our partnerships we can not offer our service, this creates an instrinsic value for our company.\r\n\r\nCommunity Members- The number of people on our platform.\r\n\r\nTraffic- The amount of traffic within our online presence. ","howIsCompanyFunded":"Self finance, Soft funding and private money","amountRaisedToDate":"70000","yourInvestors":"Our investors include the founders, and private individual&#039;s. As well as soft finance from public institutions such as; the Danish innovation fund and the European Innovation tournament.","fundingObjective":"5 000 000","numberOfFounders":"2","overallTeamSize":"6","foundersQualification":"Conor Clancy- An experienced entrepreneur with a passion for sustainability and innovation. \r\n\r\nMaria Dilling Ellken- The perfect person to create partnerships, with a background in sales and marketing. \r\n\r\nGabriel Costache (Soon to be co founder) Experienced developer with track record of producing high quality apps. ","howImpact":"Hamburg is increasingly becoming a popular destination for travellers. In 2019 7.62 people visited the city, more than 3 times the population size. \r\n\r\nWe want to make reduce the congestion on your roads and also ensure a redistribution of expenditure to benefit local neighbourhood and businesses.","whatDegreeSustainability":"Our main driving force is to address the 70% of global emissions that come from the worlds cities. However we also want to implement a socio economic impact by supporting local businesses and neighbourhoods. ","connectionToHamburg":"No","collaborateWithEntityHamburg":"No","howDidYouHearAboutFHA":"LinkedIn","contactName":"Conor Clancy","contactPosition":"CEO","contactPhoneNumber":"(454) 240-0791","contactEmail":"conor@skipit.cc","companyDeck":[{"type":"pdf","src":["DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-0.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-1.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-10.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-11.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-12.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-13.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-14.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-15.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-16.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-17.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-18.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-19.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-2.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-20.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-3.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-4.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-5.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-6.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-7.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-8.png","DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./optimized__Skipit, Pitch Deck--Feb 2021.-9.png"],"original":"DATA/media/4896334332146761226/deck/_Skipit-Pitch-Deck-Feb-2021./_Skipit, Pitch Deck--Feb 2021..pdf"}],"companyLogo":[{"type":"png","src":"DATA/media/4896334332146761226/logo/skipit-logo-01-(1)/optimized_skipit logo-01 (1).png"}]}