{"id":"4898978984515122972","startupName":"Click2Rail","tagLine":"Just click to your efficiency","website":"www.click2rail.com","foundingDate":"2018/04","stage":"seed","segmentFocus":"B2B, logistics, transport, IT, freight forwarding services","industry":"Transportation & Logistics","headquarters":"France","startupOverview":"Click2Rail - a SaaS platform enabling transport operators, freight forwarders and shippers to connect, upload their existing transport capacities or freights and proceed with slot booking. Our project’s main objective is to help railway transport increase its performance by filling in existing empty capacities (30% on average on rail in EU, >5M TEU in Eurasian region) and connecting it with other transport modes - road, inland waters and sea. Click2Rail aims to enable full connectivity of multimodal transport with regard of carbon emissions minimization, while being:\r\n* Integrative - API to users’ internal platforms;\r\n* Multimodal – connecting sea, inland water, road, rail transport;\r\n* Comprehensive – enabling users to spot and book empty slots of available transport capacities;\r\n* Enabling users to carry out door-to-door delivery.\r\nFor freight deliveries that are: \r\n* More transparent;\r\n* More connected;\r\n* More intelligent.","problemYouAreSolving":"Lack of market visibility, efficiency (unused capacities - 5M containers transported empty annually) and multimodal connectivity of railway transport. 75% of freights in EU are being transported by trucks that produce excessive CO2 emissions, while eco-transport like rail, inland waters stay unused.","productDescription":"Click2Rail - a SaaS platform enabling transport operators, freight forwarders and shippers to connect, upload their existing transport capacities or freights and proceed with slots booking. Our project’s main objective is to help railway transport increase its performance by filling in existing empty capacities and connecting it with other transport modes - road, inland waters and sea. Click2Rail aims to enable full connectivity of multimodal transport with regard of CO2 emissions minimization","whatMakesYourProductUnique":"Click2Rail - 1st digital solution aimed at optimisation of multimodal rail transport allowing users to upload their existing transports/freights, search for best deals based on price, CO2 emissions, itinerary length and modes of transport involved via smart search and transport sync using REST API.","productReadiness":"SaaS product development finalised and is in stage of its early commercialisation. Out team is currently undertaking solution beta-testing with 3 prospects, therefore customising solution to the needs of user/client if needed.","productRoadMap":"Carrier REST API, booking/quoting system, multimodal transport schedule and prices set up, realtime/email notifications, dashboards, best route planning and smart booking suggestions - 2018-2020, done Multilanguage UI - April 2021 Dashboards v2.0 (customised insights, suggestions, UI) - Q2 2021 Freights REST API  - Q2 2021 Improved legal documents system - Q3 2021","targetMarket":["Austria","Belgium","China","Czech Republic","France","Germany","Hungary","Italy","Netherlands","Poland","Russia","Spain","Switzerland"],"marketDrivers":"Drivers: 1. Liberalization of European rail market 2. 30% of containers in EU on average (5M TEU in total) are being transported empty 3. Shift to rail initiative «30 by 2030» to achieve 30% of EU freight transportation to be proceeded by rail by 2030. \r\n\r\nChallenges: 1. Low level of transparency 2. Fragmented multimodal fleet 3. Lack of digital tools for shared services","marketSize":"2,25 billion euro, 5 million empty TEU (20-foot-equivalent)","competition":"XRail (wagon booking for 7 members of cooperation), Ovrsea (digital forwarder), Sennder (digital forwarder, truck booking), Shippeo (track and tracing of road transport), TransContainer (railway operator with own digital booking tool).","strengthAgainstCompetitors":"Independent platform; \r\nOptimisation of transport capacities; \r\nMultimodal connectivity (rail, road, inland waters, maritime transport); \r\nAbility to spot and book empty capacities; \r\nIntelligent algorithms and REST API for transports and freights.","challengesAgainstCompetitors":"Becoming digital freight forwarder - obtaining transport operator license in EU","revenueSources":"Subscription to paid services, booking commission, white label contracts. \r\n","salesStrategy":"Sales strategy is based on geographical expansion to European and Asian markets. \r\nSubscription plan payments: 3 types - Basic, Regular, Premium.\r\nBooking fee 4,5% off the price: once reservation of a transport/freight capacity is proceeded.\r\nWhite label.","traction":"Beta-test: Bollore Logistics, T3M, Novatrans\r\nClients: Forwardis\r\nCommercial negos: Lineas, Geodis, CFL Multimodal, VIIA","pilotsCustomers":"Beta test / pilot launched with 2 railway operators (T3M, Novatrans) and 1 international freight forwarder (Bollore Logistics). \r\nActive user: transport operator Forwardis (affiliate company of SNCF)","metrics":"Containers proceeded: # of containers booked and transported (traction).\r\nUsers: # of transport units and lines uploaded to the platform (connectivity), # of freights added to the platform (matching).\r\nDestinations: long-haul itineraries connecting Europe and Asia (higher prices for longer trips). ","howIsCompanyFunded":"private investors, family office","amountRaisedToDate":"400000","yourInvestors":"private investors, family office","fundingObjective":"2000000","numberOfFounders":"5","overallTeamSize":"5","foundersQualification":"Anastasia Dyakonova – CEO – studied at ESCP, HSE – work experience: Engie, WPP, Alstom.\r\nIgor Mitrofanov – Lead Developer – studied at DTU, MUCTR – work experience: MiLaboratory LLC (NON-FOUNDER)\r\nFrederic Vedrunes – Blockchain Consultant – work experience: Piloteo, OTEIS, Engie Ineo.\r\nArkadiy Dyakonov – President, Railway and Logistic Expert – work experience: RZD, Gefco, Faiveley, Alstom, Carrier.\r\nChristian Rodriguez – CTO – work experience: Zyneas, IN4AGE, GeoPost.\r\n","howImpact":"Germany is considered as 1st priority market for us due to its high level of logistical infrastructure. Since Click2Rail is aiming to provide multimodal connectivity for freight inland delivery services, we see great potential in connection to transport hubs of Hamburg port and Duisburg.","whatDegreeSustainability":"Click2Rail is aimed to connect eco-friendly means of transport such as railways and inland waters in order to minimize the excessive CO2 emissions produced by truck freight transportation in EU. We provide our users, freight forwarders in particular, with data regarding transport carbon footprint.","connectionToHamburg":"no","collaborateWithEntityHamburg":"not yet","howDidYouHearAboutFHA":"LinkedIn","contactName":"Anastasia Dyakonova","contactPosition":"CEO","contactPhoneNumber":"(067) 958-2641","contactEmail":"anastasia@click2rail.com","companyDeck":[{"type":"pdf","src":["DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-0.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-1.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-10.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-11.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-12.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-13.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-14.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-15.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-16.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-17.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-18.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-19.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-2.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-3.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-4.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-5.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-6.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-7.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-8.png","DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/optimized_Click2Rail Pitch Deck ENG-9.png"],"original":"DATA/media/4898978984515122972/deck/Click2Rail-Pitch-Deck-ENG/Click2Rail Pitch Deck ENG.pdf"}],"companyLogo":[]}