{"id":"4907549314749497517","startupName":"Hanse Mondial GmbH","tagLine":"Bus rental - made easy & simple. ","website":"www.hansemondial.de ","foundingDate":"2017/12","stage":"other","segmentFocus":"B2B","industry":"Transportation & Logistics","headquarters":"Germany","startupOverview":"Hanse Mondial GmbH is a full-service mobility agency with a focus on Europe-wide bus logistics.\r\nThe asset is the network and a thus borderless Europe-wide area of operation, without its own fleet.\r\nThe flexible and individual complement to public transport, rail and especially the individual car. \r\nAccording to the modern and sustainable approach, the focus is on the optimal utilization of existing resources and the investment in digital processes. \r\nThe goal of Hanse Mondial GmbH is to rethink and actively shape the mobility of the future. \r\nBased in Hamburg, Hanse Mondial currently employs 24 people.\r\n\r\nThe 4 founders around Tobias, Chris, Emmanuel and Julien have set themselves the task to actively change the mobility of tomorrow and to form a platform for customers, employees and partners, where everyone can realize and develop. The focus is on customer benefit and fair, appreciative interaction. ","problemYouAreSolving":"Hanse Mondial GmbH solves the access to the means of transport rental bus from the customer and partner side. Creates mobility concepts with a focus on sustainable coaches for events and companies for their employees shuttle.","productDescription":"The goal of Hanse Mondial GmbH is to rethink and actively shape the mobility of the future. The digitalization of the bus industry plays a central role in this. As a flexible, individual and environmentally friendly means of transport, the coach is an indispensable part of a modern mobility concept. It uses existing infrastructure and can make its positive contribution to sustainable mobility directly in line with the motto plug and play.","whatMakesYourProductUnique":"Bus travel, bus rental and mobility solutions for everyone. Without hurdles, loss of personal contact and above all the quality and safety on the road. Through the network and the platform without its own fleet, there is greater flexibility. We are in operation where the customer expects us.","productReadiness":"The proof of concept is already there. Our customers such as Volkswagen, Amazon, Vodafone, Deutsche Post and Tesla show their trust in us. ","productRoadMap":"In the medium term, the technological infrastructure will automate the dispatching of drivers and vehicles, making it much more efficient. In addition, idle times, empty runs and available resources will be automatically integrated into an OnDemond pool and offered to the customer as an interim solution. In the long term, we see the IT interface as a coordination solution for autonomous shuttles and the mobility of the future.","targetMarket":["Denmark","France","Germany","Italy","Netherlands","Poland","Portugal","Spain","Sweden","Switzerland","United Kingdom"],"marketDrivers":"The market is currently not yet digitalized enough. There is still an inhibition. The need for individual mobility for young and old is changing, and the bus itself is still undervalued. The potential is therefore incredibly high. The focus is still too much on the passenger car...  ","marketSize":"14 Mrd. € ","competition":"The competition is at hand. The car, the train and Flixbus. In principle, our partners are also our competitors, but only until their resources are placed. Therefore, we see the simpler order processing and the digital process for customers and partners as a win-win situation for our platform.","strengthAgainstCompetitors":"Our IT infrastructure and visions of autonomous mobility are changing the way we travel in the future. Through the in-house solution and further development of the digitalization of the bus industry creates more efficient processes and utilization of existing resources without making new vehicles. ","challengesAgainstCompetitors":"The bus as an element of sustainable mobility is currently undervalued. This is a challenge that will be solved by us in the future. The Kosmus coach, consisting of a reliable and qualitative network and a value-creating IT infrastructure for the customer, is ultimately the profit-maker. ","revenueSources":"Revenues are created from the platform business for the network in the form of a licensing model, as well as the classic digital brokerage business including the handling and service of coaches and mobility concepts. ","salesStrategy":"Online marketing from a value-added communication, consulting and the conception of mobility solutions vehicles are brought to the customer. Our service and brokerage business functions like a classic platform business. Thus, the focus is on the process of connecting supply and demand. ","traction":"Hanse Mondial operates throughout Germany and Europe, moving customers and guests from A to B in a sustainable manner. Mobility within the scope of events and for companies plays an elementary role. Thus, according to Corona, the urge for experiences and the need for mobility will increase strongly.","pilotsCustomers":"Our customers such as Amazon, Tesla, Deutsche Post, numerous recruiters, Vodafone, Volkswagen, AOK, FC St. Pauli, Towers Hamburg, XING, Sopra Steria are just a few of our loyal and great customers. ","metrics":"The number of people we transport and thus reduced the use of cars. \r\nThe more buses we send on the road, the fewer cars are on the road. With one bus alone we save up to 80% Co2 compared to the use of cars. ","howIsCompanyFunded":"Self-financed through bank loans ","amountRaisedToDate":"0","yourInvestors":"-","fundingObjective":"1.000.000","numberOfFounders":"4","overallTeamSize":"24","foundersQualification":"Chris: Trained businessman in the social sector with the goal to bring employees, customers and partners through good mood day in and day out to best performance.\r\nEmmanuel: Team player and motivator. He also has a photographic memory and has access to the right bus throughout Europe.\r\nTobias: Is an IT developer and has programmed and implemented the sales route for American Express for 18 countries around the world. Builds our own IT infrastructure and puts the bus on digital wheels.\r\nJulien: Has been in the bus industry for over 12 years. At every customer request he grows beyond himself and has fun making every customer happy.","howImpact":"Our contribution is individual mobility for people with the same destination. To provide mobility when it is needed and not to keep it for the moment when it is needed. We stand for shared mobility in the bus industry and want to be more and more the alternative to the car.","whatDegreeSustainability":"Sustainability is a fundamental part of our business model. On the one hand the coach itself and on the other hand the shared approach is sustainable in itself. But also our employees and processes in the company pay into the same goal. ","connectionToHamburg":"Hamburg is the home base for the founding team. We carry the Hanseatic virtues of merchants within us and place an incredible amount of value on loyalty, fairness and appreciative cooperation. ","collaborateWithEntityHamburg":"In Hamburg we work for the cruise industry, Beiersdorf, XING, Sopran Steria and many more. ","howDidYouHearAboutFHA":"Business partner","contactName":"Figur Julien","contactPosition":"Hanse Mondial GmbH","contactPhoneNumber":"(085) 598-9011","contactEmail":"jf@hansemondial.de","companyDeck":[{"type":"pdf","src":["DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-0.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-1.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-10.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-11.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-12.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-13.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-14.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-15.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-16.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-17.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-18.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-2.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-3.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-4.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-5.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-6.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-7.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-8.png","DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/optimized_Hanse_Mondial_Buslogistics-9.png"],"original":"DATA/media/4907549314749497517/deck/Hanse_Mondial_Buslogistics/Hanse_Mondial_Buslogistics.pdf"}],"companyLogo":[{"type":"jpg","src":"DATA/media/4907549314749497517/logo/HM-Logo/optimized_HM Logo.jpg"}]}