{
  "id": "4908617492443220283",
  "startupName": "BigMile",
  "tagLine": "Finding ways to reduce your Carbon Footprint",
  "website": "www.bigmile.eu",
  "foundingDate": "20-12-2018",
  "stage": "series A",
  "segmentFocus": "B2B and authorities",
  "industry": "Transportation & Logistics",
  "headquarters": "Netherlands",
  "startupOverview": "There is a growing need for companies to start calculating the CO2-emissions of their transport and being able to allocate it to their customers and shipments. A need that makes it crucial to monitor where you stand on reducing your CO2 emissions and requires you keep track of the sustainable development goals.\r\nBigMile&#039;s carbon footprinting platform enables shippers, transporters and authorities to calculate, allocate, report and share the CO2 emmisions as a result of logistical goods flows.\r\nBigMile has been founded by Stichting Connekt aiming to support companies to improve their CO2 footprint. Districon Solutions, who developed the platform, has joined as investor mid-2020 when the platform became commercial. Since then BigMile is rapidly expending its client based with now over 200 users who are ambassadors in the field of sustainability and are prepared for the upcoming carbon accounting legislations. ",
  "problemYouAreSolving": "CO2 calculation sounds easy, but collecting reliable data and often from multiple sources or supply chain partners is always a big challenge. ",
  "productDescription": "BigMile calculates and allocates CO2 at shipment level for all logistical modalities leading to certified outcomes. We make it easy for users to prepare their input data and we enable easy sharing within the Supply Chain. With strong visualization users easily see their potential to reduce CO2",
  "whatMakesYourProductUnique": "Ability to help clients with all levels of data quality. Our platform offering in which Supply Chain partners can share CO2 information in an automated and safe manner. It is certified and ready for upcoming legislations as carbon accounting and CO2 pricing",
  "productReadiness": "Since mid 2020 the product is live and commercial. But of course we are still making our customer offering stronger and stronger improving our added value",
  "productRoadMap": "In 2021 we are going to implement scenario functionality (live now), connectivity to other software (API's) and include product CO2 to enable end to end carbon footprinting",
  "targetMarket": [
    "United States",
    "Austria",
    "Belgium",
    "Canada",
    "Czech Republic",
    "Denmark",
    "Finland",
    "France",
    "Germany",
    "Greece",
    "Iceland",
    "Ireland",
    "Italy",
    "Liechtenstein",
    "Luxembourg",
    "Netherlands",
    "Norway",
    "Poland",
    "Singapore",
    "Spain",
    "Sweden",
    "Switzerland",
    "United Kingdom"
  ],
  "marketDrivers": "With the climate changes the world is striving for reducing the GHG emissions, with the Paris climate agreement as a first objective being set. Governmental legislations make it crucial for companies to measure their GHG emissions. Also consumers are becoming to reward sustainability leading to companies having more focus on reducing their CO2 footprint. \r\nBigMile&#039;s challenges are the overall sense of urgency. Leading companies understand the need and start, followers are still reluctant. ",
  "marketSize": "All Supply Chain & logistics companies and the authorities",
  "competition": "With our unique offering we have no competition, but some parts of our offering are also provided by a limited number of companies like EcoTransIT and LogEc. ",
  "strengthAgainstCompetitors": "BigMile allocates CO2 at the lowest level, the shipment, not only a truck. And we&#039;re unique in offering the data-sharing functionality in a safe and secure manner in our platform. Last but not least we are offering scenario functionality to simulate the best initiatives you can take to reduce CO2.",
  "challengesAgainstCompetitors": "Market access, but that&#039;s probably the same challenge our competitors have",
  "revenueSources": "Our revenue comes from clients who buy annual subscriptions to our platform. Clients are shippers, transporters and authorities, many out of the Netherlands our home country, but now rapidly expending abroad, for example with our new BigMile Germany GMBH",
  "salesStrategy": "In a market we use our partner network (like Lean & Green), industry groups and of course social media to raise brand awareness. Using a regional expansion strategy we copy this to other countries, like Germany, Austria and Switzerland, who we are now approaching via our BigMile Germany GMBH entity. \r\nFrom a subscription based model we are now also developing a pay for use pricing model, but that&#039;s still in early stages of development",
  "traction": "We have many transport companies as our clients and we&#039;re starting to get manufacturers and retailers on board, especially as well due our ecommerce network. \r\nAlso authorities are using BigMile given their interest to make their region (city, country) more sustainable. ",
  "pilotsCustomers": "Some of our well know clients are Ricoh, CEVA, DHL, DPD and PostNL. At pilot level we are working with the Port of Rotterdam and the Dutch TopSektorLogistiek",
  "metrics": "200 users actively using our product with over 15 using the platform functionality on a frequent basis.\r\nLaunching BigMile Germany GMBH 9 months after the start in the Netherlands\r\nPartnerships with Lean & Green in the Netherlands, Belgium, Portugal and Ireland. With GS1 in Germany",
  "howIsCompanyFunded": "The initial funding was done by Stichting Connekt, current funding by Districon Solutions ",
  "amountRaisedToDate": "3000000",
  "yourInvestors": "Stichting Connekt\r\nDistricon Solutions",
  "fundingObjective": "NA",
  "numberOfFounders": "2",
  "overallTeamSize": "14",
  "foundersQualification": "Experts in the field of logistics and sustainability ",
  "howImpact": "With shippers and transporters using BigMile CO2 footprint in cities will improve. The city itself can track progress and buy supporting shippers and transporters to use the platform they can steer progress indirectly",
  "whatDegreeSustainability": "The platform helps clients to improve their sustainability individually and together with the supply chain partners. ",
  "connectionToHamburg": "We don&#039;t have connections yet, that&#039;s one of the reasons to join the Future Hamburg award",
  "collaborateWithEntityHamburg": "No",
  "howDidYouHearAboutFHA": "Business partner",
  "contactName": "Jack Pool",
  "contactPosition": "CEO",
  "contactPhoneNumber": "(061) 018-6276",
  "contactEmail": "j.pool@bigmile.eu",
  "companyDeck": [
    {
      "type": "pdf",
      "src": [
        "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/optimized_BigMile_Presentation_2021-Feb_Future Hamburg-0.png",
        "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/optimized_BigMile_Presentation_2021-Feb_Future Hamburg-1.png",
        "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/optimized_BigMile_Presentation_2021-Feb_Future Hamburg-10.png",
        "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/optimized_BigMile_Presentation_2021-Feb_Future Hamburg-11.png",
        "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/optimized_BigMile_Presentation_2021-Feb_Future Hamburg-2.png",
        "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/optimized_BigMile_Presentation_2021-Feb_Future Hamburg-3.png",
        "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/optimized_BigMile_Presentation_2021-Feb_Future Hamburg-4.png",
        "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/optimized_BigMile_Presentation_2021-Feb_Future Hamburg-5.png",
        "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/optimized_BigMile_Presentation_2021-Feb_Future Hamburg-6.png",
        "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/optimized_BigMile_Presentation_2021-Feb_Future Hamburg-7.png",
        "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/optimized_BigMile_Presentation_2021-Feb_Future Hamburg-8.png",
        "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/optimized_BigMile_Presentation_2021-Feb_Future Hamburg-9.png"
      ],
      "original": "DATA/media/4908617492443220283/deck/BigMile_Presentation_2021-Feb_Future-Hamburg/BigMile_Presentation_2021-Feb_Future Hamburg.pdf"
    }
  ],
  "companyLogo": [
    {
      "type": "pdf",
      "src": [
        "DATA/media/4908617492443220283/logo/20181121-BM_01_CMYK_BLACK/optimized_20181121 BM_01_CMYK_BLACK-0.png"
      ],
      "original": "DATA/media/4908617492443220283/logo/20181121-BM_01_CMYK_BLACK/20181121 BM_01_CMYK_BLACK.pdf"
    }
  ]
}
