{
  "id": "4915353221647901115",
  "startupName": "BeyondTourism",
  "tagLine": "We reinvent tourism the balanced way.",
  "website": "https://beyondtourism.de",
  "foundingDate": "2020",
  "stage": "seed",
  "segmentFocus": "B2B, B2C",
  "industry": "Software & Information Technology",
  "headquarters": "Germany",
  "startupOverview": "BeyondTourism addresses the challenge of unbalanced tourism destinations in a two step approach: the first product is the azoul App for individual travellers. The app provides smart real-time and context-aware suggestions for discovering a city or region. At the same time azoul generates data about the travel behaviour of their users. This data creates the second stage of our business model - a powerful analytics and communication tool for every destination to better understand their customers and to control guest flows in overcrowded destinations. Our vision is to become the No. 1 Travel App in 10 years, with 5 Million monthly active users and run by 80% of the Global Top Destinations. The founders worked together for 4 years as a well-practiced team at one of Germanys top spatial design agencies and realized and operated immersive and touristic solutions. Up till now we developed our MVP in less than 4 months and acquired 5 destinations for testing and as first clients.",
  "problemYouAreSolving": "The lack of control of individual tourists leads to overcrowding, undercrowding and other unbalanced tourism distributions in the destinations. These challenges will rise after Covid. The industry is now looking for digital tools for a smart reboot of travelling and to enhance visitors experience.",
  "productDescription": "We plan two complementary products: first, the smart guiding app azoul, helping tourists to discover a destination in a better and sustainable way by connecting dozens of databases in the backend in realtime and provide smart personalized recommendations. At the same time azoul provides data analytics for destinations about their visitors travel behaviour and to better communicate and interact with them in real-time (e.g. promoting special events or attractions and to avoid partial overcrowding)",
  "whatMakesYourProductUnique": "Intelligent connection of dozens of databases in real-time with context- and location-aware personalized recommendations incl. machine learning. Connection to booking engines and tourist loyalty cards. Future data analytics and communication- and interaction tool for destinations.",
  "productReadiness": "We build a working prototype in 3 months and soon test the live app in 5 destinations. First LOIs are signed already for further contracting. We are also working with the Berlin School of Economics and Law in joint research projects to develop new features in a cost-effective and scientifical way.",
  "productRoadMap": "2nd Quarter - First curated live testing with hand-picked customers in destinations + planning, developing and launching of the first whitelabels, Marketing to boost user growth. 3rd Quarter - Growing number of tourists in pilot destinations and new acquired destinations, first destinations paying for B2B features and developing additional features for the azoul app. By the end of the year - 5 Destinations running azoul app and 50k active users",
  "targetMarket": ["Austria"],
  "marketDrivers": "Main Market drivers in tourism are digitalization, sustainability and integration of new mobility services. Lifted travel restrictions will lead to partial overcrowding soon again in several destinations. With the Covid-experiences, tourists look for less crowded places off track. Challenges could be long-lasting travel restrictions due to Covid or only slow recovering outbound tourism due to slow ramp up of flight connections.",
  "marketSize": "Germany: 116,5 Mio. EUR; Europe: 3,3 Bio. EUR",
  "competition": "Our biggest competitors are big players like Google, TripAdvisor and Foursquare but also small travel guiding apps. In the B2B area there are a lot of small agencies specialized to develop software products for destinations like websites, apps, content management systems etc.",
  "strengthAgainstCompetitors": "Our strength is the versatile connections of databases in the backend in real-time and exclusive content provided by destinations. With more and more features added, azoul becomes the only travel app needed and a one-stop-shop-system for global travellers. Destinations benefit from deep data insight",
  "challengesAgainstCompetitors": "Our challenges compared with competitors is less speed in coding and developing of new product features due to a small development team. Their size and market power could overrule us in some ways. Also, many destinations and agencies are working together for years and might be hard to convince.",
  "revenueSources": "B2B - Destinations get smart data analytics of their visitors and a new guest control and communication tools, starting at 100 EUR per month. Also: whitelabel apps for destinations.\r\nB2C - Premium features with AR/VR-Apps, audio guides, exclusive content and much more from 5,99 EUR per destination.",
  "salesStrategy": "B2B products will be sold on a personal basis with a small sales team in the future. Prices start for dashboards at 100 EUR per month for small destinations and go up to several thousands of EUR for bigger ones. Individual data analytics and whitelabels are priced individually.\r\nB2C customers are aquired on social media and travel blogs but mainly with the help of the marketing channels of the destinations, because the have already plenty of followers.",
  "traction": "We build a working prototype in 3 months and test sonn in 5 destinations (Canary Islands, Norway and several German destinations). We are boosting the user growth with mutual marketing of the app with the destinations. Research and governmental partnerships help us to build trust for investors.",
  "pilotsCustomers": "Customers and pilots: WelterbeRegion Anhalt-Dessau-Wittenberg, Eidfjord (Norway)\r\n\r\nPilots: Spreewald, Seenland Oder-Spree, Mecklenburgische Seenplatte, visitBerlin, NYC&Company, La Palma (Canary Islands) and floatel (luxury and exclusive vacation home rental company)",
  "metrics": "8 pilot regions aquired without the possibility to travel and present in person, building a working MVP in only 3 months for half the estimated costs, all-over startup costs for the first year were 31 % below forecasted budget by way more output",
  "howIsCompanyFunded": "GmbH",
  "amountRaisedToDate": "300.000",
  "yourInvestors": "Friends as private investors and shareholders holding together a bit more than 50 % of the company",
  "fundingObjective": "1.000.000",
  "numberOfFounders": "3",
  "overallTeamSize": "3",
  "foundersQualification": "Marc Burgdorff (CEO), since 1984 in various activities in the tourism industry. (e.g. Head of Marketing Solution KUONI Zurich, Director of the Baltic Tourism Center and Head of Tourism at TRIAD Berlin, founder of the start-up company HiTouch- Marketing by Games)\r\nLars Fiedler (CTO) combines innovative technology with new entertainment and communication formats. Former Senior Event Designer and Master degree in edutainment industry.\r\nStephan Geyer (CFO/COO), Master degree in economics and future mobility, former COO of TRIAD Edutainment Enterprises GmbH at the Immersive Showroom Berlin / Brandenburg Gate Museum.",
  "howImpact": "We can help to \"move\" people efficiently, meaning to provide more balanced visitor flows in the city, and saving ressources due to less overusage of the cities infrastructure. The city gets a tool to easily gain data insights of their vistors and to interact and communicate with them via the app.",
  "whatDegreeSustainability": "Sustainability has a huge impact in our business modell. We plan to integrate kind of an index to suggest routes with a small CO2-footprint or promote sustainable attractions or things to do. We can also integrate sustainable mobility solutions like bicycle, car or scooter sharing and ride hailing.",
  "connectionToHamburg": "One of our shareholders, Helge Grammerstorf, is from Hamburg and supports us with consulting especially in terms of cruise industry. We also presented already to Mr. Otremba of Hamburg Tourism and Jens Meier from Hamburg Port Authority in our past role at the agency. My brother lived many many years in Hamburg and I always loved to visit him because I love the city - even more than Berlin (but don&#039;t tell the Berlin guys)",
  "collaborateWithEntityHamburg": "Not yet, but we had presentations for Hamburg Tourismus GmbH and Hamburg Port Authority.",
  "howDidYouHearAboutFHA": "Business partner",
  "contactName": "Stephan Geyer",
  "contactPosition": "CFO and COO",
  "contactPhoneNumber": "(176) 632-9289",
  "contactEmail": "geyer@beyondtourism.de",
  "companyDeck": [
    {
      "type": "pdf",
      "src": [
        "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/optimized_PITCH_SIMPLE_compressed-0.png",
        "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/optimized_PITCH_SIMPLE_compressed-1.png",
        "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/optimized_PITCH_SIMPLE_compressed-10.png",
        "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/optimized_PITCH_SIMPLE_compressed-11.png",
        "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/optimized_PITCH_SIMPLE_compressed-2.png",
        "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/optimized_PITCH_SIMPLE_compressed-3.png",
        "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/optimized_PITCH_SIMPLE_compressed-4.png",
        "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/optimized_PITCH_SIMPLE_compressed-5.png",
        "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/optimized_PITCH_SIMPLE_compressed-6.png",
        "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/optimized_PITCH_SIMPLE_compressed-7.png",
        "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/optimized_PITCH_SIMPLE_compressed-8.png",
        "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/optimized_PITCH_SIMPLE_compressed-9.png"
      ],
      "original": "DATA/media/4915353221647901115/deck/PITCH_SIMPLE_compressed/PITCH_SIMPLE_compressed.pdf"
    }
  ],
  "companyLogo": [
    {
      "type": "png",
      "src": "DATA/media/4915353221647901115/logo/BeyondTourism/optimized_BeyondTourism.png"
    }
  ]
}
