{"id":"4918889426515242743","startupName":"KONVOI","tagLine":"prevent cargo theft!","website":"https://www.konvoi.eu","foundingDate":"2020","stage":"seed","segmentFocus":"B2B","industry":"Transportation & Logistics","headquarters":"Germany","startupOverview":"At KONVOI we are developing a preventive security system for parked trucks. Sensors are used to create a detection zone around the truck continuesly detecting approaching humans and classifying risk. Thus, we can individually initiate measures, like light, acoustics, camera or an alarm to external security services. Our vision is that transportation companies can fully focus on their core competency and drivers are safe during parking.","problemYouAreSolving":"26.000 trucks are affected in Germany by cargo theft every year leading to a loss of 1.3 billion €. 0.9 billion € of delays in deliveries and production losses are additionally accounted. Increasing transport volumes and poor parking conditions are further aspects of the problem.  ","productDescription":"Our product is built of hardware, software and service parts to undermine a full service security solution. Mobile and optimized radar sensors are detecting and tracking approaching objects, which are classified by our algorithms continuously. Individual measures like light, acoustics, camera and an alarm discourage potential criminals before any damage happens to the truck. We will be able to develop a self learning system, predict potential parking risks and improve route planning in long term","whatMakesYourProductUnique":"The mobile and individual solution helps independent from infrastructure preventing cargo theft before any damage occurs.","productReadiness":"We are working with testing customers hand in hand in the product development with the plan to present a first prototype this year.","productRoadMap":"Demonstration and development of several MVPs right now. This will lead to a proper prototype being ready for real environment operation on trucks at the end of this year. Improvements will be made to launch a product in the end of 2022.","targetMarket":["Germany"],"marketDrivers":"Increasing E-Commerce and  transport volume for road freight cargo on the one hand. On the other hand: Low innovation level in the market. Difficult acceptance of completely new products. Low margin business in transportation.  Heterogeneous market structure with about 15000 freight forwarding companies.","marketSize":"3,41 Mio zugelassene LKW in DE, davon 2,42 Mio LKW im Fokus der Kriminellen","competition":"Main competition are on the one hand traditional theft prevention measures like locks and seals. On the other hand alarm curtains, acoustic detection or tracking systems are also partly in competition as they can be combined with our system.","strengthAgainstCompetitors":"Nobody in the market is focusing on the USP of prevention before damages to the truck occur. None of the others provide a full security service for trucking companies.","challengesAgainstCompetitors":"Completely new products have to be explained and our deep tech solution needs a longer intial development cycle.","revenueSources":"Revenues will be achieved first of all directly from trucking companies and in later stages in cooperation with insurance companies and security consulting companies on a provision basis.","salesStrategy":"Our security solution is available within a monthly-payment subscription model enabling the full service to the customer while keeping initial investment level low for the customer.","traction":"Traction will be generated through different players in the market. We want to partner with trucking companies, insurances, security consulting services, public organizations.","pilotsCustomers":"Selected trucking companies for testing. Working on CRM pipeline for the rollout next year.","metrics":"Number of prevented thefts in coordination with a minimum number of false alarms during real environment situations. Number of equipped trucks of the KONVOI fleet determine the ability of self learning of our system.","howIsCompanyFunded":"Its currently bootstrapped and funded by the EXIST grant for founders.","amountRaisedToDate":"135000","yourInvestors":"None","fundingObjective":"500000","numberOfFounders":"3","overallTeamSize":"5","foundersQualification":"Divya Settimali studied Automotive Software Engineering. Through her practical experience she was able to deepen her knowledge in the fields of embedded and digital systems. She is responsible for our software development. During his studies, Alexander Jagielo dealt in detail with cargo theft in a research project. He brings relevant logistics know-how and is responsible for product development. He met Heinz Luckhardt in his master&#039;s program in industrial engineering and worked together on projects to develop business models. Heinz brings expertise in business models, financials and investments, he takes responsibility for business developmen","howImpact":"Making cargo transportation including truck parking, drivers&#039; recovery breaks and the infrastructure of parking spots safer.","whatDegreeSustainability":"As our product grows with the number of trucks in the KONVOI fleet we are aiming for a sustainable and long term solution to improve conditions in the transportation industry. By increasing the mobility and flexibility of transports we can reduce the time of searching secured parking spots. ","connectionToHamburg":"We studied at Hamburg University of Technology (TUHH) and founded our company in Hamburg in 2020. We have already partners from Hamburg (trucking companies, industry experts) and see Hamburg with the large logistics industry as the perfect playground.","collaborateWithEntityHamburg":"We are collaborate within the StartUp Dock (consultants, startups, university).","howDidYouHearAboutFHA":"Digital article","contactName":"Heinz Luckhardt","contactPosition":"Co-founder","contactPhoneNumber":"(163) 906-7060","contactEmail":"heinz.luckhardt@konvoi.eu","companyDeck":[{"type":"pdf","src":["DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/optimized_2021_02_Pitchdeck_KONVOI-0.png","DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/optimized_2021_02_Pitchdeck_KONVOI-1.png","DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/optimized_2021_02_Pitchdeck_KONVOI-10.png","DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/optimized_2021_02_Pitchdeck_KONVOI-11.png","DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/optimized_2021_02_Pitchdeck_KONVOI-2.png","DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/optimized_2021_02_Pitchdeck_KONVOI-3.png","DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/optimized_2021_02_Pitchdeck_KONVOI-4.png","DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/optimized_2021_02_Pitchdeck_KONVOI-5.png","DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/optimized_2021_02_Pitchdeck_KONVOI-6.png","DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/optimized_2021_02_Pitchdeck_KONVOI-7.png","DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/optimized_2021_02_Pitchdeck_KONVOI-8.png","DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/optimized_2021_02_Pitchdeck_KONVOI-9.png"],"original":"DATA/media/4918889426515242743/deck/2021_02_Pitchdeck_KONVOI/2021_02_Pitchdeck_KONVOI.pdf"}],"companyLogo":[{"type":"jpg","src":"DATA/media/4918889426515242743/logo/KONVOI_Logo_weiss/optimized_KONVOI_Logo_weiß.jpg"}]}