{"id":"4918774585255154578","startupName":"NATIX GmbH","tagLine":"We make cameras smart and GDPR compliant","website":"www.natix.io","foundingDate":"2020","stage":"seed","segmentFocus":"B2B(2G)","industry":"Software & Information Technology","headquarters":"Germany","startupOverview":"Despite the advancements in both camera and computer vision technology, cities and industry struggle to adopt these even for non-surveillance purposes. One of the main reasons for this is the lack of acceptance by citizens, staff, and worker counsels due to privacy concerns!\r\n\r\nNATIX gives cameras brains and makes them GDPR compliant. Connect an off-the-shelf AI processors (Edge Computers) to any camera, install our software on them, and let the AI detect the event of your choice. Upon detection, a notification with annonymized footage is sent to our dashboard or any client of your choice. \r\n\r\nNATIX technology is currently being used by E.ON, Deutsche Telekom, City of Den Haag, Stadtwerke Lübeck and more!\r\n\r\nOur Story\r\nNATIX is a fast-growing tech company active in the field of computer vision (AI) and camera technology for cities and industries. We are based in Hamburg and are a culturally diverse and growing team from more than 7 countries. ","problemYouAreSolving":"Despite the advancements in both camera and computer vision technology, cities and industry struggle to adopt these even for non-surveillance purposes. One of the main reasons for this is the lack of acceptance by citizens, staff, and worker counsels.","productDescription":"NATIX provides you with all technological enablers to create and maintain your desired event detection solution, on the Edge, and with high efficiency. We provide an end-2-end solution that enables our customers to build privacy-preserving event detection AI in only few lines of code, bring it to the camera over-the-air, manage the workflow and view the events in an intuitive dashboard.","whatMakesYourProductUnique":"Privacy-enforcing: On-device processing + anonymization AI   Lower Cost: Saving you a lot of money on cloud and connectivity infrastructure, AI development and maintenance.  Same camera, unlimited Use-cases: With our tools, build new AIs and update cameras remotely","productReadiness":"Our product is functional and used by various cities and industries (clients include city of Den Haag, E.ON, Stadtwerk Lübeck, Deutsche Telekom)","productRoadMap":"We plan to publish and open source NATIX Vision SDK by Q3 2021. NATIX Vision SDK, developers can build Event Detection AI with only few simple lines of code. ","targetMarket":["United States","Germany","Netherlands"],"marketDrivers":"Privacy is a fundamental human right and more more cities and governments are starting to reflect this into the new regulations. We believe privacy-preserving use of camera would be must in near future and enforced by citizens and worker councils for cities and industry. ","marketSize":"Market size 2022 TAM: 45.7 Billion € SAM: 685 Million € TOM:144 Million €","competition":"Please see the presentation (competitor slide)\r\n","strengthAgainstCompetitors":"Please see the presentation (competitor slide)\r\n","challengesAgainstCompetitors":"Please see the presentation (competitor slide)\r\n","revenueSources":"Private investors, public fund and client projects","salesStrategy":"We offer a tiered license subscription model where we charge per device per month (depending on which features the client is interested to use)","traction":"We have 4 products (Crowd Density, Parking Spot Monitoring, Zone safety supervision and Virtual Doorman) all with paying customers - These products help us to accelerate platform launch!\r\n","pilotsCustomers":"Paying customers or paying pilots converting into service terms (Highlights): City of Den Haag (NL), Deutsche Telekom, E.ON, E.DIS, Stadtwerk Lübeck, Dräger, Technikzentrum Lübeck\r\n","metrics":"- Number of paying customers \r\n- Sales pipeline (advanced stages)\r\n- Sales partnerships with local (e.g. Stadtwerke) and global system integrators \r\n- Growth rate: Team, Funding, etc.","howIsCompanyFunded":"VCs, Angel Investors, Public Funds","amountRaisedToDate":"1250000","yourInvestors":"Plug and Play Ventures LLC (USA)\r\nCoinIX Capital\r\nAngel Investors\r\nInno Forderung Bank Hamburg\r\nThe Federal Ministry of Economic Affairs and Energy (EXIST Program)\r\nGateway49 Accelerator (European Union Funded)","fundingObjective":"2500000","numberOfFounders":"3","overallTeamSize":"14","foundersQualification":"Dr. Alireza Ghods: Ph.D. in Electrical Engineering (wireless com.) with >8 years of R&D and business experience in the fields of IoT and distributed systems. \r\n\r\nOmid Mogharian: Senior software architect and software developer with more than 14 years os experience in the industry. \r\n\r\nLorenz Muck: >6 years PO and Consultanting experience with special focus on Video AI\r\n","howImpact":"NATIX enables hamburg to use camera infrastructure as a flexible and multipurpose sensor that is compliant with Data Privacy laws (GDPR) and accepted by citizen. With Our technology, the same infrastructure can be used for improvement in traffic and mobility sector as well as safety and security.","whatDegreeSustainability":"Our on-device AI platform reduces the need for expensive and not-sustainable cloud and connectivity infrastructure. Also, since the same camera can be used as a multipurpose sensor, there will be no need for various sensory solutions which come with installation effort and sustainability challenges ","connectionToHamburg":"We are a Hamburg-based startup and hold close collaboration with hamburg entities such as ARIC, Plug and Play Hamburg, IFB and more","collaborateWithEntityHamburg":"Yes. ARIC, Plug and Play Hamburg, IFB, Hochbahn and ITS2021","howDidYouHearAboutFHA":"Business partner","contactName":"Alireza Ghods","contactPosition":"CEO","contactPhoneNumber":"(176) 825-3099","contactEmail":"alireza@natix.io","companyDeck":[{"type":"pdf","src":["DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-0.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-1.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-10.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-11.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-12.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-13.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-14.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-2.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-3.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-4.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-5.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-6.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-7.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-8.png","DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/optimized_PR_ NATIX 07.03.21-9.png"],"original":"DATA/media/4918774585255154578/deck/PR_-NATIX-07.03.21/PR_ NATIX 07.03.21.pdf"}],"companyLogo":[{"type":"png","src":"DATA/media/4918774585255154578/logo/1_logo_on_light-(5)/optimized_1_logo_on_light (5).png"}]}