{"id":"4920686800121878011","startupName":"VOWAG","tagLine":"The world's strongest cargobike","website":"www.vowag.de","foundingDate":"2020","stage":"other","segmentFocus":"B2B","industry":"Transportation & Logistics","headquarters":"Germany","startupOverview":"Micromobilty and the last mile problems of green & silent transport still haven&#039;t been solved today. We would like to support this process - with our electric cargobike for heavy weights.  Our founder Sven Knorr believes in the necessity of new technologies and would like to dedicate his accumulated experience to the challenges of e-mobility. Since 2018, he has been passionately pursuing the vision of producing the most stable & powerful electric load bike that can be relied upon in daily use.\r\nWith our CARGO M load bike we have created a real all-rounder: for facility management, municipal tasks, streetfood, logistics, promotion, rental and many other areas are among the fields of application. We would like to take on the task of meeting the growing demand for sustainable transport solutions. Concepts for micro-mobility are the future of large city centres. We would like to be one of the first to fill the gap between e-bike and van with our high-quality CARGO M “Made in Germany”.","problemYouAreSolving":"Cities are crowded, eCommerce and delivery services raise the need to transport goods to peoples homes. Cities try to avoid cars and have more bike&pedestrian zones at the same time. We can access these, be silent, CO2 free and easy to handle. We can and will be part of a cleaner, greener city.","productDescription":"The CARGO M is a robust and high-quality vehicle that can be relied upon in daily use. With its extreme loading capacity of up to 500 kg (incl. driver) as well as the loading area of 1.27 m x 0.98 m (designed for the transport of one Euro pallet), our Cargobike is the perfect partner for inner-city transport. Thanks to the modular approach, the application field ranges from logistics to facility management, municipal tasks to promotion, streetfood, rental and sharing concepts.","whatMakesYourProductUnique":"No cargobike can carry more weight. Our product comes from car manufacturing expertise - the single parts are more stable than in the bike industry. We never break down and never give up. There are no additional costs to the vehicles for maintenance and tax. And no drivers license required.","productReadiness":"The first bikes are on the road. Many startups and bigger companies have ordered their individualized bikes already. We're expanding the production line to serve up to 500 cargobikes per year from today on. ","productRoadMap":"Proof of concept in all varieties (food, logistics, care, facility management, promotion) and expansion. Additional features, e.g. for telematics. And other requirements from the first customer feedbacks.","targetMarket":["Austria","Belgium","Bulgaria","Croatia","Czech Republic","Denmark","Estonia","Finland","France","Germany","Greece","Hungary","Ireland","Italy","Liechtenstein","Luxembourg","Malta","Netherlands","Norway","Portugal","Romania","Slovakia","Spain","Sweden","Switzerland"],"marketDrivers":"21% of the new cars in Germany have been electric cars in 2020. The B2B industry is following, the pressure of being sustainably is rising and companies understand that they need to act. \r\nWe can now - for the first time - offer a product that fit&#039;s the people&#039;s needs if they are in between a smaller bike and a van. The government supports cargobikes with public grants. We have a pretty good offer: So our biggest challenge today is to get more awareness - that&#039;s why we apply and rely on you. ","marketSize":"400000000","competition":"We mainly compete with cars. Smaller cargobikes with less capacity can also be competitors, but these might be less convincing in terms of stability and endurance. Our main competitors are the small vans and (diesel) powered micromobilty cars that are used to solve micromobility today.\r\n\r\n","strengthAgainstCompetitors":"You can ride your cargobike right to the venue and park there (less time loss for the search of parking slots). You can enter biking zones in the city and avoid traffic jams. You save money (no parking tickets, no licenses, no tax, less gas). It&#039;s positive for your image. And: You&#039;ll get funding. ","challengesAgainstCompetitors":"We can only manufactur up to 500 bikes per year so far, so huge fleet management might (still) cause problems. Also telematics are on the roadmap for autumn 2021 only. In terms of pricing, we&#039;re ready to compete. The awareness for heavy-weight cargobikes needs to raise, too, but we&#039;re on a good way.","revenueSources":"We rely on sales from one single platform but for many fields of applications: Thanks to the modular approach, this ranges from logistics to facility management, municipal tasks to promotion, streetfood, rental and sharing concepts. Parts delivery may add a second revenue source soon. ","salesStrategy":"We rely on direct marketing and networks that might profit from our solutions in general. \r\nOur cargobikes start from EUR 7.600 and can be individualized in various ways. ","traction":"We have started in Germany and will sell cargobikes all over Europe in 2021. If this is successful and if we manage to expand our production capabilities, we will soon deliver the solution worldwide. \r\nWe have excellence in quality and endurance - and we see that this creates the biggest traction.","pilotsCustomers":"We can&#039;t talk about the first upcoming customers (yet) but here is a first impression from our product test day in Berlin 2020: https://www.youtube.com/watch?v=Xeee1ed81ng&t=14s ","metrics":"Payload: Loading area max. 300 kg\r\nLoading area (L x W): 1270 mm x 980 mm\r\nLoading volume:  approx. 1.6 m³ (at 1.3 m loading height)\r\nTurning circle: 6,15 m\r\nRange: Up to 75 km (depending on load, temperature, driving style and topography)\r\n\r\nThis makes us the strongest cargobike on earth. ","howIsCompanyFunded":"bootstrapping","amountRaisedToDate":"0","yourInvestors":"We&#039;re owned and driven by serial founder Sven Knorr. Thanks to years of experience, he knows how to develop and produce robust vehicles. Under the flag of SAM09 he successfully reached the finish of the Dakar Rally 2013, the toughest motor sport event in the world, with a self constructed vehicle.","fundingObjective":"0","numberOfFounders":"1","overallTeamSize":"13","foundersQualification":"Founder Sven Knorr (Dipl.-Ing.) believes in the necessity of new technologies and would like to dedicate his accumulated experience to the challenges of e-mobility. Since 2018, he has been passionately pursuing the vision of producing the most stable & powerful electric load bike that can be relied upon in daily use.","howImpact":"Imagine the Jungfernstieg. Without cars, but still provided with goods by e-cargobikes. And the port - with so many smaller transport occations that can be done by our cargobikes, without lots of efforts, without noise or emissions. We can and will be part of the last mile solutions worldwide. ","whatDegreeSustainability":"We&#039;re 100% sustainability-driven: Our cargobikes have no emission, due to our robust parts we will reduce service to a minimum and also support the goal of massive noise reduction in the cities. ","connectionToHamburg":"so far we don&#039;t have a connection but we would love to contribute, e.g. for the micromobilty hub solutions, Smart Last Mile Logistics (SMILE) and the next projects to solve the last mile problems. ","collaborateWithEntityHamburg":"no. ","howDidYouHearAboutFHA":"Business partner","contactName":"Christian Lademann","contactPosition":"Head of Marketing and Sales","contactPhoneNumber":"(015) 175-9925","contactEmail":"christian.lademann@vowag.de","companyDeck":[{"type":"pdf","src":["DATA/media/4920686800121878011/deck/VOWAG-CARGO-M-update/optimized_VOWAG CARGO M update-0.png","DATA/media/4920686800121878011/deck/VOWAG-CARGO-M-update/optimized_VOWAG CARGO M update-1.png","DATA/media/4920686800121878011/deck/VOWAG-CARGO-M-update/optimized_VOWAG CARGO M update-2.png","DATA/media/4920686800121878011/deck/VOWAG-CARGO-M-update/optimized_VOWAG CARGO M update-3.png","DATA/media/4920686800121878011/deck/VOWAG-CARGO-M-update/optimized_VOWAG CARGO M update-4.png","DATA/media/4920686800121878011/deck/VOWAG-CARGO-M-update/optimized_VOWAG CARGO M update-5.png","DATA/media/4920686800121878011/deck/VOWAG-CARGO-M-update/optimized_VOWAG CARGO M update-6.png","DATA/media/4920686800121878011/deck/VOWAG-CARGO-M-update/optimized_VOWAG CARGO M update-7.png"],"original":"DATA/media/4920686800121878011/deck/VOWAG-CARGO-M-update/VOWAG CARGO M update.pdf"}],"companyLogo":[{"type":"jpg","src":"DATA/media/4920686800121878011/logo/cargo-m-letzte-meile/optimized_cargo-m-letzte-meile.jpg"},{"type":"jpg","src":"DATA/media/4920686800121878011/logo/sven-knorr/optimized_sven-knorr.jpg"},{"type":"jpg","src":"DATA/media/4920686800121878011/logo/vowag/optimized_vowag.jpg"}]}