{"id":"4922385489511925877","startupName":"Papair","tagLine":"Protect your Products and Protect our Enviroment","website":"www.papair.de","foundingDate":"2020","stage":"pre-seed","segmentFocus":"B2B","industry":"Printing & Packaging","headquarters":"Germany","startupOverview":"Papair develops innovative technologies for the production of sustainable packaging materials, the first of these enables the production of a \"bubble wrap made of paper\", which combines cost efficiency, cushioning and sustainability like no other product before. Even though there are lot of sustainable alternatives in the market, none of these products is able to replace plastics succesfully, which is mainly because of higher prizes or the volume that is needed to provide proper protection. This will be solved by papairs products. The market for protective packaging is huge at an yearly turnover of 2 bil. europewide it growths with 5% per year. The founders are longterm friends and perfect complements to each other, with two having a technical background and one focussed on the business aspects. Papair is allthough still in product development able to attract large interest and secure future customers. The vision of a world without unnecessary is the constant motivation.\r\n","problemYouAreSolving":"Even though there are plenty of sustainable packaging solutions in the market, they are not able to replace plastics succesfully and match its combination of price and cushioning. Plastic therefore still pollutes our nature. ","productDescription":"The paper bubble wrap is the sustainable alternative to conventional packaging materials: On the one hand, it is made of 100% recycled paper, thus preventing unnecessary plastic waste, and on the other hand, it saves approx. 75% CO2 emissions during its life cycle compared to. the competitor product. Overall, it combines cost efficiency, as it is costneutral to conventional bubble wrap, cushioning capability and sustainability like no other product before it.","whatMakesYourProductUnique":"Papairs bubble wrap made of 100% recycling paper combines like no other packaging material before sustainability, cushioning abilities and cost efficiency, thus is able to pose the sustainable alternative to conventional packaging materials.","productReadiness":"As of now papairs paperbased bubble wrap is still in the prototyping progress, allthough there are allready promissing samples at hand the product launch will still take until the end of the year. Nevertheless basic goals and requirements can allready be met. The TR Level is therefore at 4.","productRoadMap":"Delayed by the Corona Virus it is finally possible to firstly produce industrially in early May on a multitool machine with custommade tools. Then the first Machines in laboratory sizes will be designed and manufactured. As market entry papair plans to introduce sustainable shipping bags based on the bubble wrap made of paper. The plan is to have the shipping bags in the market by the end of the year. The introduction of the cushioning material itself will not take place before summer next year.","targetMarket":["Germany"],"marketDrivers":"The market for protective packaging is booming thanks to the overall explosion of eCommerce in the recent years. Packaging and in particular sustainable packaging is therefore on the rise. Nevertheless, due to the overall success story in the market innovations are neglected or not implemented, which leads to a similar product environment over the last decades (e.g. bubble wrap, card board), innovations productwise (and overall) are therefore scarce. ","marketSize":"GER (1,5 Mil), EU (2 Bil), TOTAL (7,8 Bil)","competition":"There are a large number of competitors of various sizes, but they only have a small variety of products. Our novel technology therefore offers us promising opportunities to differentiate ourselves from them on the basis of our product properties and in terms of sustainability and handling.","strengthAgainstCompetitors":"The packaging industry is a very conservative and traditional business environment. With papairs innovative technology and in addition its fresh ambitious founders, papair is able to revolutionize the branch. Especially from a story telling and marketing point of view, papair holds big potential.","challengesAgainstCompetitors":"As the packaging indutry is about a giant output equivalant machinery is necessary to cope with the circumstances. Therefore the capital requirements make it difficult for start-ups to enter the market.","revenueSources":"Revenue is generated through out licensing the technology to both machine builders and packaging producers. While machine builders can distribute a new type of technology and pay a part of their profit. Packaging manufacturers pay royalties depending on the sales generated thanks to Papair. ","salesStrategy":"For our licensing model to take effect, our product must first prove itself in the market. To this end, we plan to use our cushioning paper in sustainable envelopes. The envelope will be priced at the same level as plastic-based envelopes. Then one machine builders exclusively distributes our technology, papairs share of profits amounts to 10% in this case. The corresponding producers pays 25% of his revenue as royalties.","traction":"Right now papair aims for a demand pull effect through a innovative appearance within the packaging field targeting also customers, even though they essentially not the stakeholders buying the product. This is also fueled by the huge impact papair generates for the sake of the planet. ","pilotsCustomers":"Despite still in prototyping papair was already able to secure promising letter of intents amounting to an overall volume over 150k €. In particular the field of shipping bags raises a lot of interests, which is also a reason why it will be the first product in the market. Talks with partners productionswise are also ongoing and promising.","metrics":"Generated Revenue, Licensing Partners, CO2 Emissions circumvented, Plastic waste avoided, Number of Employees.","howIsCompanyFunded":"received personal funding scolarships by the NBank, BA invesment of 100k imminent.","amountRaisedToDate":"100.000","yourInvestors":"Troy Rass\r\n\r\nCrowdvesting Camapign tba","fundingObjective":"1.000.000","numberOfFounders":"3","overallTeamSize":"3","foundersQualification":"Christopher Feist, 26 Years old, M.Sc. Management and Economics, previously at Deloitte and COMATCH, specialized in Business Development, Strategy and Finance. \r\nSteven Widdel, 25 Years old, M.Sc. candidate Technology of renewable raw materials, previously at Volkswagen, specialized in product development and Business intelligence.\r\nFabian Solf, 26 years old, B.Sc. Wood Engineering, previously at Airbus, specialized in rapid prototyping and 3D-Print. \r\nAll founders connect a over 10 years lasting friendship routing in sports.\r\n","howImpact":"Our product is predestined to make supply chains more sustainable, which is an important asset of any city of the future. Furthermore papair offers and cost effective and reliable packaging solution that prevents plastic waste as it often can be seen especially in high-densed areas.","whatDegreeSustainability":"Sustainabilty is at the core of papairs business as it prevents unecessary plastic waste and its fatal consequences like CO2 emissions or mircoplastics. ","connectionToHamburg":"Christopher and Fabian both lived in Hamburg when the worked for Deloitte and Airbus, they therefore have a close network within the city and look back to a lot of good memories. Papair is also in contact with some enviromental friendly start ups that are located in Hamburg (wild plastic, runamics).","collaborateWithEntityHamburg":"Not yet.","howDidYouHearAboutFHA":"Digital article","contactName":"Christopher Feist","contactPosition":"CEO","contactPhoneNumber":"(017) 269-3871","contactEmail":"c.feist@papair.de","companyDeck":[{"type":"pdf","src":["DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/optimized_Pitch Deck_Future HH-0.png","DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/optimized_Pitch Deck_Future HH-1.png","DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/optimized_Pitch Deck_Future HH-10.png","DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/optimized_Pitch Deck_Future HH-11.png","DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/optimized_Pitch Deck_Future HH-2.png","DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/optimized_Pitch Deck_Future HH-3.png","DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/optimized_Pitch Deck_Future HH-4.png","DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/optimized_Pitch Deck_Future HH-5.png","DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/optimized_Pitch Deck_Future HH-6.png","DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/optimized_Pitch Deck_Future HH-7.png","DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/optimized_Pitch Deck_Future HH-8.png","DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/optimized_Pitch Deck_Future HH-9.png"],"original":"DATA/media/4922385489511925877/deck/Pitch-Deck_Future-HH/Pitch Deck_Future HH.pdf"}],"companyLogo":[{"src":"DATA/media/4922385489511925877/logo/6oIgmXJw_2/optimized_6oIgmXJw_2.jpeg"},{"type":"jpg","src":"DATA/media/4922385489511925877/logo/IMG_5726-(2)/optimized_IMG_5726 (2).jpg"},{"type":"jpg","src":"DATA/media/4922385489511925877/logo/IMG_5774_2/optimized_IMG_5774_2.jpg"},{"type":"png","src":"DATA/media/4922385489511925877/logo/kolibri_logo_papair/optimized_kolibri_logo_papair.png"}]}